emacs.d/emacs.org
#+OPTIONS: toc:0 num:nil
# #######################################################################
#+TITLE:     gugutz emacs config
#+SUBTITLE:  ORGfied configuration for Emacs
#+AUTHOR:    Gustavo P Borges
#+EMAIL:     gustavo.pb1984@aluno.ifsc.edu.br
#+DESCRIPTION: This file is compiled to init.el automatically on every save
# #######################################################################

* Recompile init.el everytime emacs.org is changed and saved
  
: Moved this to beggining of the file to avoid it not being parsed when theres an error in the middle of the file
: It was being recompiled without this function so i had to manually re-copy first-init.el to make it compile first time again and again


#+BEGIN_SRC emacs-lisp :tangle init.el
(defun /util/tangle-init ()
  (interactive)
  "If the current buffer is init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "emacs.org")))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "init.el")))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'after-save-hook #'/util/tangle-init)
#+END_SRC


* General editor settings 
  
** Allow access from emacsclient
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'server)
  (unless (or (daemonp) (server-running-p))
    (server-start))
#+END_SRC

** Prevent emacs to create lockfiles (.#files#). 
   
PS: this also stops preventing editing colisions, so watch out

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq create-lockfiles nil)
#+END_SRC

** Use the system clipboard
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq x-select-enable-clipboard t)
#+END_SRC

** Always follow symbolic links to edit the 'actual' file it points to
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq vc-follow-symlinks t)
#+END_SRC

** Enable mouse support in terminal mode
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(when (eq window-system nil)
  (xterm-mouse-mode 1))
#+END_SRC

** Save all tempfiles in $TMPDIR/emacs$UID/
   
#+BEGIN_SRC emacs-lisp :tangle init.el
    (defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
    (setq backup-directory-alist
        `((".*" . ,emacs-tmp-dir)))
    (setq auto-save-file-name-transforms
        `((".*" ,emacs-tmp-dir t)))
    (setq auto-save-list-file-prefix
        emacs-tmp-dir)
#+END_SRC
        
** Disable the annoying Emacs bell ring (beep)

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq ring-bell-function 'ignore)
#+END_SRC

** Disable initial scratch message
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq initial-scratch-message nil)
#+END_SRC
** Create alias to yes-or-no anwsers (y-or-n-p
#+BEGIN_SRC emacs-lisp :tangle init.el
(defalias 'yes-or-no-p 'y-or-n-p)
(fset 'yes-or-no-p 'y-or-n-p) 
#+END_SRC


** show matching parenthesis
#+BEGIN_SRC emacs-lisp :tangle init.el
  ; parentheses
  (show-paren-mode t)
#+END_SRC

** default indentation
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default indent-tabs-mode nil)
  (setq-default c-basic-offset 2)
#+END_SRC

** show line numbers
#+BEGIN_SRC emacs-lisp :tangle init.el
  (when (version<= "26.0.50" emacs-version )
    (global-display-line-numbers-mode))
#+END_SRC

** line number : pretty format
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq linum-format " %d ")
#+END_SRC

** superword-mode and subword-modes
: Alt+x subword-mode. It change all cursor movement/edit commands to stop in-between the “camelCase” words.
: Alt+x superword-mode (emacs 24.4) is similar. It treats text like “x_y” as one word. Useful for “snake_case”.
: subword-mode and superword-mode are mutally exclusive. Turning one on turns off the other.

: Enable global subword-mode (disabled - its enable per file according to language)

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (global-subword-mode 1)
#+END_SRC
 
** Turn on auto-revert mode (auto updates files changed on disk)
#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-auto-revert-mode 1)
  (setq auto-revert-interval 0.5)
#+END_SRC

** Spellchecking
#+BEGIN_SRC emacs-lisp :tangle init.el
(defconst *spell-check-support-enabled* t) ;; Enable with t if you prefer
#+END_SRC

** C-n insert newlines if the point is at the end of the buffer. 
: Useful, as it means you won’t have to reach for the return key to add newlines!
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq next-line-add-newlines t)
#+END_SRC



** Increase, decrease and adjust font size

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C-_") #'text-scale-decrease)
  ;; (global-set-key (kbd "C-)") #'text-scale-adjust)
#+END_SRC

** expand-region
 #+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
   ;; (require 'expand-region)
   (global-set-key (kbd "C-TAB") 'er/expand-region)
 #+END_SRC

** hippie-expand (native emacs expand function)

 #+BEGIN_SRC emacs-lisp :tangle init.el
 (global-set-key "\M- " 'hippie-expand)
 #+END_SRC

 
* Macros and helper functions
  
** Bindings


 : These macros are to help me remap keys.

 #+BEGIN_SRC emacs-lisp :tangle init.el
 (defmacro /bindings/define-prefix-keys (keymap prefix &rest body)
   (declare (indent defun))
   `(progn
      ,@(cl-loop for binding in body
                 collect
                 `(let ((seq ,(car binding))
                        (func ,(cadr binding))
                        (desc ,(caddr binding)))
                    (define-key ,keymap (kbd seq) func)
                    (when desc
                      (which-key-add-key-based-replacements
                        (if ,prefix
                            (concat ,prefix " " seq)
                          seq)
                        desc))))))

 (defmacro /bindings/define-keys (keymap &rest body)
   (declare (indent defun))
   `(/bindings/define-prefix-keys ,keymap nil ,@body))

 (defmacro /bindings/define-key (keymap sequence binding &optional description)
   (declare (indent defun))
   `(/bindings/define-prefix-keys ,keymap nil
      (,sequence ,binding ,description)))
 #+END_SRC


