emacs.d/emacs.tex
% Created 2019-09-12 qui 19:03
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Gustavo P Borges}
\date{\today}
\title{gugutz emacs config\\\medskip
\large ORGfied configuration for Emacs}
\hypersetup{
 pdfauthor={Gustavo P Borges},
 pdftitle={gugutz emacs config},
 pdfkeywords={},
 pdfsubject={This file is compiled to init.el automatically on every save},
 pdfcreator={Emacs 26.2 (Org mode 9.2.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{0}
\tableofcontents


\section*{Recompile init.el everytime emacs.org is changed and saved}
\label{sec:orgf083100}

\begin{verbatim}
Moved this to beggining of the file to avoid it not being parsed when theres an error in the middle of the file
It was being recompiled without this function so i had to manually re-copy first-init.el to make it compile first time again and again
\end{verbatim}



\begin{verbatim}
(defun /util/tangle-init ()
  (interactive)
  "If the current buffer is init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "emacs.org")))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "init.el")))))
\end{verbatim}

\begin{verbatim}
(add-hook 'after-save-hook #'/util/tangle-init)
\end{verbatim}


\section*{General editor settings}
\label{sec:orgc55845a}

\subsection*{Allow access from emacsclient}
\label{sec:org811dc98}

\begin{verbatim}
(require 'server)
(unless (or (daemonp) (server-running-p))
  (server-start))
\end{verbatim}

\subsection*{Prevent emacs to create lockfiles (.\#files\#).}
\label{sec:orga0db61d}

PS: this also stops preventing editing colisions, so watch out

\begin{verbatim}
(setq create-lockfiles nil)
\end{verbatim}

\subsection*{Use the system clipboard}
\label{sec:org3457311}
\begin{verbatim}
(setq x-select-enable-clipboard t)
\end{verbatim}

\subsection*{Always follow symbolic links to edit the 'actual' file it points to}
\label{sec:org42c347a}

\begin{verbatim}
(setq vc-follow-symlinks t)
\end{verbatim}

\subsection*{Enable mouse support in terminal mode}
\label{sec:org4c04811}

\begin{verbatim}
(when (eq window-system nil)
  (xterm-mouse-mode 1))
\end{verbatim}

\subsection*{Save all tempfiles in \$TMPDIR/emacs\$UID/}
\label{sec:orgaa10a00}

\begin{verbatim}
(defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
(setq backup-directory-alist
    `((".*" . ,emacs-tmp-dir)))
(setq auto-save-file-name-transforms
    `((".*" ,emacs-tmp-dir t)))
(setq auto-save-list-file-prefix
    emacs-tmp-dir)
\end{verbatim}

\subsection*{Disable the annoying Emacs bell ring (beep)}
\label{sec:orgbf1fef5}

\begin{verbatim}
(setq ring-bell-function 'ignore)
\end{verbatim}

\subsection*{Disable initial scratch message}
\label{sec:org888e9b4}
\begin{verbatim}
(setq initial-scratch-message nil)
\end{verbatim}
\subsection*{Create alias to yes-or-no anwsers (y-or-n-p}
\label{sec:org4abf6c6}
\begin{verbatim}
(defalias 'yes-or-no-p 'y-or-n-p)
(fset 'yes-or-no-p 'y-or-n-p) 
\end{verbatim}


\subsection*{show matching parenthesis}
\label{sec:orgec9465d}
\begin{verbatim}
; parentheses
(show-paren-mode t)
\end{verbatim}

\subsection*{default indentation}
\label{sec:orgfb60ba4}
\begin{verbatim}
(setq-default indent-tabs-mode nil)
(setq-default c-basic-offset 2)
\end{verbatim}

\subsection*{show line numbers}
\label{sec:orgdc90f6c}
\begin{verbatim}
(when (version<= "26.0.50" emacs-version )
  (global-display-line-numbers-mode))
\end{verbatim}

\subsection*{line number : pretty format}
\label{sec:orge562435}
\begin{verbatim}
(setq linum-format " %d ")
\end{verbatim}

\subsection*{superword-mode and subword-modes}
\label{sec:org2f8ef3e}
\begin{verbatim}
Alt+x subword-mode. It change all cursor movement/edit commands to stop in-between the “camelCase” words.
Alt+x superword-mode (emacs 24.4) is similar. It treats text like “x_y” as one word. Useful for “snake_case”.
subword-mode and superword-mode are mutally exclusive. Turning one on turns off the other.
\end{verbatim}


\begin{verbatim}
Enable global subword-mode (disabled - its enable per file according to language)
\end{verbatim}


\begin{verbatim}
;; (global-subword-mode 1)
\end{verbatim}

\subsection*{Turn on auto-revert mode (auto updates files changed on disk)}
\label{sec:org58ab644}
\begin{verbatim}
(global-auto-revert-mode 1)
(setq auto-revert-interval 0.5)
\end{verbatim}

\subsection*{Spellchecking}
\label{sec:org1d2991b}
\begin{verbatim}
(defconst *spell-check-support-enabled* t) ;; Enable with t if you prefer
\end{verbatim}

\subsection*{C-n insert newlines if the point is at the end of the buffer.}
\label{sec:org137ad7f}
\begin{verbatim}
Useful, as it means you won’t have to reach for the return key to add newlines!
\end{verbatim}

\begin{verbatim}
(setq next-line-add-newlines t)
\end{verbatim}



\subsection*{Increase, decrease and adjust font size}
\label{sec:org3fc381f}

\begin{verbatim}
(global-set-key (kbd "C-+") #'text-scale-increase)
(global-set-key (kbd "C-_") #'text-scale-decrease)
;; (global-set-key (kbd "C-)") #'text-scale-adjust)
\end{verbatim}

\subsection*{expand-region}
\label{sec:orgc98d361}
\begin{verbatim}
;; (require 'expand-region)
(global-set-key (kbd "C-TAB") 'er/expand-region)
\end{verbatim}

\subsection*{hippie-expand (native emacs expand function)}
\label{sec:orgfff8450}

\begin{verbatim}
(global-set-key "\M- " 'hippie-expand)
\end{verbatim}


\section*{Macros and helper functions}
\label{sec:orgf14d985}

\subsection*{Bindings}
\label{sec:orgb1e89d6}


\begin{verbatim}
These macros are to help me remap keys.
\end{verbatim}


\begin{verbatim}
(defmacro /bindings/define-prefix-keys (keymap prefix &rest body)
  (declare (indent defun))
  `(progn
     ,@(cl-loop for binding in body
                collect
                `(let ((seq ,(car binding))
                       (func ,(cadr binding))
                       (desc ,(caddr binding)))
                   (define-key ,keymap (kbd seq) func)
                   (when desc
                     (which-key-add-key-based-replacements
                       (if ,prefix
                           (concat ,prefix " " seq)
                         seq)
                       desc))))))

(defmacro /bindings/define-keys (keymap &rest body)
  (declare (indent defun))
  `(/bindings/define-prefix-keys ,keymap nil ,@body))

(defmacro /bindings/define-key (keymap sequence binding &optional description)
  (declare (indent defun))
  `(/bindings/define-prefix-keys ,keymap nil
     (,sequence ,binding ,description)))
\end{verbatim}
