emacs.d/emacs.org
** After 

 : with-eval-after-load is a function that lets you defer execution of code until after a feature has been loaded.
 : It is very useful to only load some packages when they’re, and because of that it is extensively used in this setup. 
 : So of course there is a macro to make it simpler. It can also run code if a package has been installed by using “pkgname-autoloads” or only if multiple packages have been loaded.
 : This also avoids loading config for packages that haven’t been loaded yet, resulting in void variables of function definitions. 
 : This was take from milkypostman (along with some other things).

 #+BEGIN_SRC emacs-lisp :tangle init.el
 ;; examples
 ;; after [evil magit] (
   ;; execute after evil and magit have been loaded
 ;  )

 ;; macro definiton
 (defmacro after (feature &rest body)
   "Executes BODY after FEATURE has been loaded.

 FEATURE may be any one of:
     'evil            => (with-eval-after-load 'evil BODY)
     \"evil-autoloads\" => (with-eval-after-load \"evil-autolaods\" BODY)
     [evil cider]     => (with-eval-after-load 'evil
                           (with-eval-after-load 'cider
                             BODY))
 "
   (declare (indent 1))
   (cond
    ((vectorp feature)
     (let ((prog (macroexp-progn body)))
       (cl-loop for f across feature
                do
                (progn
                  (setq prog (append `(',f) `(,prog)))
                  (setq prog (append '(with-eval-after-load) prog))))
       prog))
    (t
     `(with-eval-after-load ,feature ,@body))))
 #+END_SRC


** Auto save function

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun my-save ()
    "Save file when leaving insert mode in Evil."
    (if (buffer-file-name)
	(evil-save)))
#+END_SRC

*** This hook to the above function was breaking the evil-esc-delay 0
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (add-hook 'evil-insert-state-exit-hook 'my-save)
#+END_SRC



* GPG Encryption

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'epa-file)
(epa-file-enable)
#+END_SRC


* Packages
** package repositories

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'package)
  ;; add melpa stable emacs package repository
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t) ; Org-mode's repository
#+END_SRC

** initialize packages
#+BEGIN_SRC emacs-lisp :tangle init.el
  (package-initialize)
#+END_SRC

moved this part to beggining of the file because if the
custom-safe-themes variable is not set before smart-mode-line (sml) activates
emacs asks 2 annoying confirmations on every startup before actually starting

#+BEGIN_SRC emacs-lisp :tangle init.el
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-safe-themes
   (quote
    ("84d2f9eeb3f82d619ca4bfffe5f157282f4779732f48a5ac1484d94d5ff5b279" "57f95012730e3a03ebddb7f2925861ade87f53d5bbb255398357731a7b1ac0e0" "3c83b3676d796422704082049fc38b6966bcad960f896669dfc21a7a37a748fa" default)))
 '(fci-rule-color "#3E4451")
 '(package-selected-packages
   (quote
   (pdf-tools ox-pandoc ox-reveal org-preview-html latex-preview-pane smart-mode-line-powerline-theme base16-theme gruvbox-theme darktooth-theme rainbow-mode smartscan restclient editorconfig prettier-js pandoc rjsx-mode js2-refactor web-mode evil-org multiple-cursors flycheck smart-mode-line ## evil-leader evil-commentary evil-surround htmlize magit neotree evil json-mode web-serverx org))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+END_SRC

** Add the folder 'config' to emacs load-path so i can require stuff from there

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'load-path (expand-file-name "config" user-emacs-directory))
  ;; (add-to-list 'load-path "~/dotfiles/emacs.d/config")

#+END_SRC









* Require my personal packages
#+BEGIN_SRC emacs-lisp :tangle init.el

    (require 'evil.tau)
    (require 'org.tau)
    (require 'ruby.tau)
    (require 'elixir.tau)
    
#+END_SRC


* Evil

: All Evil settings are meant to be isolated in a separate file evil.tau.

** Require Evil related packages

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (require 'evil)
  (evil-mode 1)
#+END_SRC

** Don't wait for any other keys after escape is pressed.
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (setq evil-esc-delay 0)
#+END_SRC

** Make Evil look a bit more like (n) vim  (??)
: not sure what all these options do yet

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (setq evil-search-module 'isearch-regexp)
  (setq evil-magic 'very-magic)
  (setq evil-shift-width (symbol-value 'tab-width))
  (setq evil-regexp-search t)
  (setq evil-search-wrap t)
  ;; (setq evil-want-C-i-jump t)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-fine-undo nil)
  (setq evil-want-integration nil)
  ;; (setq evil-want-abbrev-on-insert-exit nil)
  (setq evil-want-abbrev-expand-on-insert-exit nil)
  ;; move evil tag to beginning of modeline
  (setq evil-mode-line-format '(before . mode-line-front-space))
#+END_SRC

** Window and buffer navigation with vim-like bindings

*** vim-like navigation using C- HJKL (uppercase homerow keys)
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; for some readon the bellow lines should be the default native way for navigation on emacs
  ;; but they dont work
  ;; using the above package instead til i find a solution
  ;
  (windmove-default-keybindings 'control)
  (global-set-key (kbd "C-H") 'windmove-left)
  (global-set-key (kbd "C-L") 'windmove-right)
  (global-set-key (kbd "C-K") 'windmove-up)
  (global-set-key (kbd "C-J") 'windmove-down)
#+END_SRC

*** vim-like navigation with C-w hjkl


 # #+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
 #   (/bindings/define-keys evil-normal-state-map
 #     ("C-w h" #'evil-window-left)
 #     ("C-w j" #'evil-window-down)
 #     ("C-w k" #'evil-window-up)
 #     ("C-w l" #'evil-window-right))
 # #+END_SRC


: Bellow i use the `define-keys` function to map window navigation to default Vim bindings <C-hjkl>

: First require the file with the function

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (require 'evil-tmux-navigator)
#+END_SRC


: Then create the keybindings 
#+BEGIN_SRC emacs-lisp :tangle init.el
  (define-prefix-command 'evil-window-map)
  (define-key evil-window-map "h" 'evil-window-left)
  (define-key evil-window-map "j" 'evil-window-down)
  (define-key evil-window-map "k" 'evil-window-up)
  (define-key evil-window-map "l" 'evil-window-right)
  (define-key evil-window-map "b" 'evil-window-bottom-right)
  (define-key evil-window-map "c" 'evil-window-delete)
  (define-key evil-motion-state-map "\M-w" 'evil-window-map)
#+END_SRC

    
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (/bindings/define-keys evil-normal-state-map
    ;; ("C-w h" #'evil-window-left)
    ;; ("C-w j" #'evil-window-down)
    ;; ("C-w k" #'evil-window-up)
    ;; ("C-w l" #'evil-window-right))
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (/bindings/define-keys evil-normal-state-map
  ;;   ("C-w h" #'evil-window-left)
  ;;   ("C-w j" #'evil-window-down)
  ;;   ("C-w k" #'evil-window-up)
  ;;   ("C-w l" #'evil-window-right))
#+END_SRC

   
