emacs.d/emacs.tex


\subsection*{After}
\label{sec:org65acd41}

\begin{verbatim}
with-eval-after-load is a function that lets you defer execution of code until after a feature has been loaded.
It is very useful to only load some packages when they’re, and because of that it is extensively used in this setup. 
So of course there is a macro to make it simpler. It can also run code if a package has been installed by using “pkgname-autoloads” or only if multiple packages have been loaded.
This also avoids loading config for packages that haven’t been loaded yet, resulting in void variables of function definitions. 
This was take from milkypostman (along with some other things).
\end{verbatim}


\begin{verbatim}
;; examples
;; after [evil magit] (
  ;; execute after evil and magit have been loaded
;  )

;; macro definiton
(defmacro after (feature &rest body)
  "Executes BODY after FEATURE has been loaded.

FEATURE may be any one of:
    'evil            => (with-eval-after-load 'evil BODY)
    \"evil-autoloads\" => (with-eval-after-load \"evil-autolaods\" BODY)
    [evil cider]     => (with-eval-after-load 'evil
                          (with-eval-after-load 'cider
                            BODY))
"
  (declare (indent 1))
  (cond
   ((vectorp feature)
    (let ((prog (macroexp-progn body)))
      (cl-loop for f across feature
               do
               (progn
                 (setq prog (append `(',f) `(,prog)))
                 (setq prog (append '(with-eval-after-load) prog))))
      prog))
   (t
    `(with-eval-after-load ,feature ,@body))))
\end{verbatim}


\subsection*{Auto save function}
\label{sec:org7e1e865}

\begin{verbatim}
(defun my-save ()
  "Save file when leaving insert mode in Evil."
  (if (buffer-file-name)
      (evil-save)))
\end{verbatim}

\subsubsection*{This hook to the above function was breaking the evil-esc-delay 0}
\label{sec:org698b094}
\begin{verbatim}
;; (add-hook 'evil-insert-state-exit-hook 'my-save)
\end{verbatim}



\section*{GPG Encryption}
\label{sec:org5510d5d}

\begin{verbatim}
(require 'epa-file)
(epa-file-enable)
\end{verbatim}


\section*{Packages}
\label{sec:org94f182c}
\subsection*{package repositories}
\label{sec:org32d2d58}

\begin{verbatim}
(require 'package)
;; add melpa stable emacs package repository
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t) ; Org-mode's repository
\end{verbatim}

\subsection*{initialize packages}
\label{sec:org7c52bae}
\begin{verbatim}
(package-initialize)
\end{verbatim}

moved this part to beggining of the file because if the
custom-safe-themes variable is not set before smart-mode-line (sml) activates
emacs asks 2 annoying confirmations on every startup before actually starting

\begin{verbatim}
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-safe-themes
   (quote
    ("84d2f9eeb3f82d619ca4bfffe5f157282f4779732f48a5ac1484d94d5ff5b279" "57f95012730e3a03ebddb7f2925861ade87f53d5bbb255398357731a7b1ac0e0" "3c83b3676d796422704082049fc38b6966bcad960f896669dfc21a7a37a748fa" default)))
 '(fci-rule-color "#3E4451")
 '(package-selected-packages
   (quote
   (pdf-tools ox-pandoc ox-reveal org-preview-html latex-preview-pane smart-mode-line-powerline-theme base16-theme gruvbox-theme darktooth-theme rainbow-mode smartscan restclient editorconfig prettier-js pandoc rjsx-mode js2-refactor web-mode evil-org multiple-cursors flycheck smart-mode-line ## evil-leader evil-commentary evil-surround htmlize magit neotree evil json-mode web-serverx org))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
\end{verbatim}

\subsection*{Add the folder 'config' to emacs load-path so i can require stuff from there}
\label{sec:orgdc05d3c}

\begin{verbatim}
(add-to-list 'load-path (expand-file-name "config" user-emacs-directory))
;; (add-to-list 'load-path "~/dotfiles/emacs.d/config")

\end{verbatim}









\section*{Require my personal packages}
\label{sec:org3a1be9f}
\begin{verbatim}

(require 'evil.tau)
(require 'org.tau)
(require 'ruby.tau)
(require 'elixir.tau)

\end{verbatim}


\section*{Evil}
\label{sec:orge233c30}

\begin{verbatim}
All Evil settings are meant to be isolated in a separate file evil.tau.
\end{verbatim}

\subsection*{Require Evil related packages}
\label{sec:org4a3591a}

\begin{verbatim}
(require 'evil)
(evil-mode 1)
\end{verbatim}

\subsection*{Don't wait for any other keys after escape is pressed.}
\label{sec:org6a53348}
\begin{verbatim}
(setq evil-esc-delay 0)
\end{verbatim}

\subsection*{Make Evil look a bit more like (n) vim  (??)}
\label{sec:org8cc7190}
\begin{verbatim}
not sure what all these options do yet
\end{verbatim}


\begin{verbatim}
(setq evil-search-module 'isearch-regexp)
(setq evil-magic 'very-magic)
(setq evil-shift-width (symbol-value 'tab-width))
(setq evil-regexp-search t)
(setq evil-search-wrap t)
;; (setq evil-want-C-i-jump t)
(setq evil-want-C-u-scroll t)
(setq evil-want-fine-undo nil)
(setq evil-want-integration nil)
;; (setq evil-want-abbrev-on-insert-exit nil)
(setq evil-want-abbrev-expand-on-insert-exit nil)
;; move evil tag to beginning of modeline
(setq evil-mode-line-format '(before . mode-line-front-space))
\end{verbatim}

\subsection*{Window and buffer navigation with vim-like bindings}
\label{sec:orgbb97fd8}

\subsubsection*{vim-like navigation using C- HJKL (uppercase homerow keys)}
\label{sec:org9706fc9}
\begin{verbatim}
;; for some readon the bellow lines should be the default native way for navigation on emacs
;; but they dont work
;; using the above package instead til i find a solution
;
(windmove-default-keybindings 'control)
(global-set-key (kbd "C-H") 'windmove-left)
(global-set-key (kbd "C-L") 'windmove-right)
(global-set-key (kbd "C-K") 'windmove-up)
(global-set-key (kbd "C-J") 'windmove-down)
\end{verbatim}

\subsubsection*{vim-like navigation with C-w hjkl}
\label{sec:org3e71338}


\begin{verbatim}
Bellow i use the `define-keys` function to map window navigation to default Vim bindings <C-hjkl>
\end{verbatim}


\begin{verbatim}
First require the file with the function
\end{verbatim}


\begin{verbatim}
;; (require 'evil-tmux-navigator)
\end{verbatim}


\begin{verbatim}
Then create the keybindings 
\end{verbatim}

\begin{verbatim}
(define-prefix-command 'evil-window-map)
(define-key evil-window-map "h" 'evil-window-left)
(define-key evil-window-map "j" 'evil-window-down)
(define-key evil-window-map "k" 'evil-window-up)
(define-key evil-window-map "l" 'evil-window-right)
(define-key evil-window-map "b" 'evil-window-bottom-right)
(define-key evil-window-map "c" 'evil-window-delete)
(define-key evil-motion-state-map "\M-w" 'evil-window-map)
\end{verbatim}


\begin{verbatim}
;; (/bindings/define-keys evil-normal-state-map
  ;; ("C-w h" #'evil-window-left)
  ;; ("C-w j" #'evil-window-down)
  ;; ("C-w k" #'evil-window-up)
  ;; ("C-w l" #'evil-window-right))
\end{verbatim}


\begin{verbatim}
;; (/bindings/define-keys evil-normal-state-map
;;   ("C-w h" #'evil-window-left)
;;   ("C-w j" #'evil-window-down)
;;   ("C-w k" #'evil-window-up)
;;   ("C-w l" #'evil-window-right))
\end{verbatim}
