emacs.d/emacs.org
** Resolve issue with Tab not working with ORG only in Normal VI Mode in terminal
   
(something with TAB on terminals being related to C-i...)

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  (add-hook 'org-mode-hook                                                                      
            (lambda ()                                                                          
          (define-key evil-normal-state-map (kbd "TAB") 'org-cycle))) 

  ;; (setq evil-want-C-i-jump nil)
#+END_SRC
 


** Show CLOSED tag line in closed TODO items
   
#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(setq org-log-done 'time)
#+END_SRC

** Prompt to leave a note when closing an item
#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(setq org-log-done 'note)
#+END_SRC

#+BEGIN_NOTE 
Also achievable on a per file basis with: #+STARTUP: logdone
#+STARTUP: logdone
#+STARTUP: lognotedone.
#+END_NOTE

** Function to activate export-on-save in org mode

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(defun toggle-org-html-export-on-save ()
  "Make Emacs auto-export to HTML when org file is saved.
Enable calling this function from the file with <M-x>."
  (interactive)
  (if (memq 'org-html-export-to-html after-save-hook)
      (progn
        (remove-hook 'after-save-hook 'org-html-export-to-html t)
        (message "Disabled org html export on save for current buffer..."))
    (add-hook 'after-save-hook 'org-html-export-to-html nil t)
    (message "Enabled org html export on save for current buffer...")))
#+END_SRC

** Add hook to auto-export automatically on saveing ORG files

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  (defun org-mode-export-hook ()
    "This exports to diffenent outputs everytime the file is saved.
  This will be added to org-mode-hook, so it only activates on ORG files.
  Generates outputs in these formats:
  - PDF
  - HTML
  - RevealJS."
     (add-hook 'after-save-hook 'org-beamer-export-to-pdf t t)
     (add-hook 'after-save-hook 'org-reveal-export-to-html t t))

  ; Finally adds the above hook in org-mode-hook.
  ;; (add-hook 'org-mode-hook #'org-mode-export-hook)
#+END_SRC


** add suport for the ignore tag (ignores a headline without ignoring its content)
#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
#+END_SRC

** Evil-ORG

 #+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
   (after 'org
     (require 'evil-org)
     (require 'evil-org-agenda)
     (add-hook 'org-mode-hook #'evil-org-mode)
     (add-hook 'evil-org-mode-hook
	       (lambda ()
		 (evil-org-set-key-theme))))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
 ;; (add-hook 'org-mode-hook 'evil-org-mode)
 ;; (evil-org-set-key-theme '(navigation insert textobjects additional calendar))
 ;; (evil-org-agenda-set-keys)
 #+END_SRC

** ox-pandoc

As pandoc supports many number of formats, initial org-export-dispatch
shortcut menu does not show full of its supported formats. You can customize
org-pandoc-menu-entry variable (and probably restart Emacs) to change its
default menu entries.
If you want delayed loading of `ox-pandoc’ when org-pandoc-menu-entry
is customized, please consider the following settings in your init file"

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(with-eval-after-load 'ox
  (require 'ox-pandoc))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(require 'ox-pandoc)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  ;; default options for all output formats
  (setq org-pandoc-options '((standalone . t)))
  ;; cancel above settings only for 'docx' format
  (setq org-pandoc-options-for-docx '((standalone . nil)))
  ;; special settings for beamer-pdf and latex-pdf exporters
  (setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))
  (setq org-pandoc-options-for-latex-pdf '((pdf-engine . "luatex")))
  ;; special extensions for markdown_github output
  (setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))
#+END_SRC

** ox-twbs (exporter to twitter bootstrap html)
#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
   (setq org-enable-bootstrap-support t)
#+END_SRC
   
** ReveaJS org-reveal:
: This delay makes the options to export to RevealJS appear on the exporter menu (C-c C-e)

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(with-eval-after-load 'ox
  (require 'ox-reveal))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
(require 'ox-reveal)
#+END_SRC


** UTF8 pretty bullets in org mode
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))


* Helm

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'helm)

(setq helm-bookmark-show-location t)
(setq helm-buffer-max-length 40)
(setq helm-split-window-inside-p t)
(setq helm-mode-fuzzy-match t)
(setq helm-ff-file-name-history-use-recentf t)
(setq helm-ff-skip-boring-files t)
(setq helm-follow-mode-persistent t)

(after 'helm-source
  (defun /helm/make-source (f &rest args)
    (let ((source-type (cadr args))
          (props (cddr args)))
      (unless (child-of-class-p source-type 'helm-source-async)
        (plist-put props :fuzzy-match t))
      (apply f args)))
  (advice-add 'helm-make-source :around '/helm/make-source))
#+END_SRC


** Other helm settings

#+BEGIN_SRC emacs-lisp :tangle init.el
(after 'helm
  ;; take between 10-30% of screen space
  (setq helm-autoresize-min-height 10)
  (setq helm-autoresize-max-height 30)
  (helm-autoresize-mode t))
#+END_SRC

: Make helm replace the default Find-File and M-x

#+BEGIN_SRC emacs-lisp :tangle init.el
   (progn
   (global-set-key [remap execute-extended-command] #'helm-M-x)
   (global-set-key [remap find-file] #'helm-find-files)
   (helm-mode t))
#+END_SRC

** Helm related bindings
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (after 'helm
    (require 'helm-config)
    (global-set-key (kbd "C-c h") #'helm-command-prefix)
    (global-unset-key (kbd "C-x c"))
    ;; (global-set-key (kbd "C-h a") #'helm-apropos)
    (global-set-key (kbd "C-x b") #'helm-buffers-list)
    (global-set-key (kbd "C-x C-b") #'helm-mini)
    (global-set-key (kbd "C-x C-f") #'helm-find-files)
    (global-set-key (kbd "C-x r b") #'helm-bookmarks)
    (global-set-key (kbd "M-x") #'helm-M-x)
    (global-set-key (kbd "M-y") #'helm-show-kill-ring)
    (global-set-key (kbd "M-:") #'helm-eval-expression-with-eldoc)
    (define-key helm-map (kbd "<tab>") #'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-z") #'helm-select-action)
  )
#+END_SRC


* Projectile
  
** Activate Projectile
#+BEGIN_SRC emacs-lisp :tangle init.el
(projectile-mode +1)
(define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
#+END_SRC


* Dired

#+BEGIN_SRC emacs-lisp :tangle init.el
  (after 'dired
    (require 'dired-k)
    (setq dired-k-style 'git)
    (setq dired-k-human-readable t)
    (add-hook 'dired-initial-position-hook #'dired-k))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
(setq dired-dwin-target t)
#+END_SRC


* Magit

** Load evil-magit with magit buffer

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (require 'evil-magit)
  (evil-magit-init)
#+END_SRC


** define global keybing to magit-status
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key (kbd "C-x g") 'magit-status)
#+END_SRC
   

* treemacs (neotree like navigation)
  
** Load treemacs and its relevant subpackages
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (require 'treemacs)

  ;; (after [treemacs evil] (
  (require 'treemacs-evil)
   ;; ))

  ;; (after [treemacs magit] (
  (require 'treemacs-magit)
   ;; ))

  ;; (after [treemacs projectile] (
  (require 'treemacs-projectile)
   ;; ))
#+END_SRC

** toggle treemacs with F7
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(global-set-key [f8] 'treemacs)
#+END_SRC

