emacs.d/emacs.tex

\subsection*{Require ORG}
\label{sec:org291f647}

\begin{verbatim}
(require 'org)
\end{verbatim}

\subsection*{Resolve issue with Tab not working with ORG only in Normal VI Mode in terminal}
\label{sec:orgdc67caf}

(something with TAB on terminals being related to C-i\ldots{})

\begin{verbatim}
(add-hook 'org-mode-hook                                                                      
          (lambda ()                                                                          
        (define-key evil-normal-state-map (kbd "TAB") 'org-cycle))) 

;; (setq evil-want-C-i-jump nil)
\end{verbatim}



\subsection*{Show CLOSED tag line in closed TODO items}
\label{sec:orge3fbef0}

\begin{verbatim}
(setq org-log-done 'time)
\end{verbatim}

\subsection*{Prompt to leave a note when closing an item}
\label{sec:orge79888a}
\begin{verbatim}
(setq org-log-done 'note)
\end{verbatim}

\begin{NOTE}
Also achievable on a per file basis with: \#+STARTUP: logdone
\end{NOTE}

\subsection*{Function to activate export-on-save in org mode}
\label{sec:org455d727}

\begin{verbatim}
(defun toggle-org-html-export-on-save ()
  "Make Emacs auto-export to HTML when org file is saved.
Enable calling this function from the file with <M-x>."
  (interactive)
  (if (memq 'org-html-export-to-html after-save-hook)
      (progn
        (remove-hook 'after-save-hook 'org-html-export-to-html t)
        (message "Disabled org html export on save for current buffer..."))
    (add-hook 'after-save-hook 'org-html-export-to-html nil t)
    (message "Enabled org html export on save for current buffer...")))
\end{verbatim}

\subsection*{Add hook to auto-export automatically on saveing ORG files}
\label{sec:org22017a6}

\begin{verbatim}
(defun org-mode-export-hook ()
  "This exports to diffenent outputs everytime the file is saved.
This will be added to org-mode-hook, so it only activates on ORG files.
Generates outputs in these formats:
- PDF
- HTML
- RevealJS."
   (add-hook 'after-save-hook 'org-beamer-export-to-pdf t t)
   (add-hook 'after-save-hook 'org-reveal-export-to-html t t))

; Finally adds the above hook in org-mode-hook.
;; (add-hook 'org-mode-hook #'org-mode-export-hook)
\end{verbatim}


\subsection*{add suport for the ignore tag (ignores a headline without ignoring its content)}
\label{sec:orgd85509d}
\begin{verbatim}
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
\end{verbatim}

\subsection*{Evil-ORG}
\label{sec:org8f41f40}

\begin{verbatim}
(after 'org
  (require 'evil-org)
  (require 'evil-org-agenda)
  (add-hook 'org-mode-hook #'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme))))
\end{verbatim}

\begin{verbatim}
;; (add-hook 'org-mode-hook 'evil-org-mode)
;; (evil-org-set-key-theme '(navigation insert textobjects additional calendar))
;; (evil-org-agenda-set-keys)
\end{verbatim}

\subsection*{ox-pandoc}
\label{sec:org1761667}

As pandoc supports many number of formats, initial org-export-dispatch
shortcut menu does not show full of its supported formats. You can customize
org-pandoc-menu-entry variable (and probably restart Emacs) to change its
default menu entries.
If you want delayed loading of `ox-pandoc’ when org-pandoc-menu-entry
is customized, please consider the following settings in your init file``

\begin{verbatim}
(with-eval-after-load 'ox
  (require 'ox-pandoc))
\end{verbatim}

\begin{verbatim}
(require 'ox-pandoc)
\end{verbatim}

\begin{verbatim}
;; default options for all output formats
(setq org-pandoc-options '((standalone . t)))
;; cancel above settings only for 'docx' format
(setq org-pandoc-options-for-docx '((standalone . nil)))
;; special settings for beamer-pdf and latex-pdf exporters
(setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))
(setq org-pandoc-options-for-latex-pdf '((pdf-engine . "luatex")))
;; special extensions for markdown_github output
(setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))
\end{verbatim}

\subsection*{ox-twbs (exporter to twitter bootstrap html)}
\label{sec:orge287151}
\begin{verbatim}
(setq org-enable-bootstrap-support t)
\end{verbatim}

\subsection*{ReveaJS org-reveal:}
\label{sec:org500e21b}
\begin{verbatim}
This delay makes the options to export to RevealJS appear on the exporter menu (C-c C-e)
\end{verbatim}


\begin{verbatim}
(with-eval-after-load 'ox
  (require 'ox-reveal))
\end{verbatim}

\begin{verbatim}
(require 'ox-reveal)
\end{verbatim}


\subsection*{UTF8 pretty bullets in org mode}
\label{sec:org3bdd29f}
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))


\section*{Helm}
\label{sec:orga8f7555}

\begin{verbatim}
(require 'helm)

(setq helm-bookmark-show-location t)
(setq helm-buffer-max-length 40)
(setq helm-split-window-inside-p t)
(setq helm-mode-fuzzy-match t)
(setq helm-ff-file-name-history-use-recentf t)
(setq helm-ff-skip-boring-files t)
(setq helm-follow-mode-persistent t)

(after 'helm-source
  (defun /helm/make-source (f &rest args)
    (let ((source-type (cadr args))
          (props (cddr args)))
      (unless (child-of-class-p source-type 'helm-source-async)
        (plist-put props :fuzzy-match t))
      (apply f args)))
  (advice-add 'helm-make-source :around '/helm/make-source))
\end{verbatim}


\subsection*{Other helm settings}
\label{sec:orgea8e9a8}

\begin{verbatim}
(after 'helm
  ;; take between 10-30% of screen space
  (setq helm-autoresize-min-height 10)
  (setq helm-autoresize-max-height 30)
  (helm-autoresize-mode t))
\end{verbatim}

\begin{verbatim}
Make helm replace the default Find-File and M-x
\end{verbatim}


\begin{verbatim}
(progn
(global-set-key [remap execute-extended-command] #'helm-M-x)
(global-set-key [remap find-file] #'helm-find-files)
(helm-mode t))
\end{verbatim}

\subsection*{Helm related bindings}
\label{sec:orge900aa9}

\begin{verbatim}
(after 'helm
  (require 'helm-config)
  (global-set-key (kbd "C-c h") #'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))
  ;; (global-set-key (kbd "C-h a") #'helm-apropos)
  (global-set-key (kbd "C-x b") #'helm-buffers-list)
  (global-set-key (kbd "C-x C-b") #'helm-mini)
  (global-set-key (kbd "C-x C-f") #'helm-find-files)
  (global-set-key (kbd "C-x r b") #'helm-bookmarks)
  (global-set-key (kbd "M-x") #'helm-M-x)
  (global-set-key (kbd "M-y") #'helm-show-kill-ring)
  (global-set-key (kbd "M-:") #'helm-eval-expression-with-eldoc)
  (define-key helm-map (kbd "<tab>") #'helm-execute-persistent-action)
  (define-key helm-map (kbd "C-z") #'helm-select-action)
)
\end{verbatim}


\section*{Projectile}
\label{sec:org9b277b0}

\subsection*{Activate Projectile}
\label{sec:org4ffd080}
\begin{verbatim}
(projectile-mode +1)
(define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
\end{verbatim}


\section*{Dired}
\label{sec:org50fe3b6}

\begin{verbatim}
(after 'dired
  (require 'dired-k)
  (setq dired-k-style 'git)
  (setq dired-k-human-readable t)
  (add-hook 'dired-initial-position-hook #'dired-k))
\end{verbatim}

\begin{verbatim}
(setq dired-dwin-target t)
\end{verbatim}


\section*{Magit}
\label{sec:org11b8a8e}

\subsection*{Load evil-magit with magit buffer}
\label{sec:orgb97d849}

\begin{verbatim}
(require 'evil-magit)
(evil-magit-init)
\end{verbatim}


\subsection*{define global keybing to magit-status}
\label{sec:org4eedf4e}

\begin{verbatim}
(global-set-key (kbd "C-x g") 'magit-status)
\end{verbatim}


\section*{treemacs (neotree like navigation)}
\label{sec:orgbb1c654}

\subsection*{Load treemacs and its relevant subpackages}
\label{sec:orgb30f0a4}
\begin{verbatim}
(require 'treemacs)

;; (after [treemacs evil] (
(require 'treemacs-evil)
 ;; ))

;; (after [treemacs magit] (
(require 'treemacs-magit)
 ;; ))

;; (after [treemacs projectile] (
(require 'treemacs-projectile)
 ;; ))
\end{verbatim}

\subsection*{toggle treemacs with F7}
\label{sec:orgc7658e6}
\begin{verbatim}
(global-set-key [f8] 'treemacs)
\end{verbatim}
