emacs.d/emacs.org
** treemacs-git-mode
`treemacs-git-mode` is a global minor mode which enables treemacs to check for files’ and directories’ git status information and highlight them accordingly (see also the treemacs-git-... faces). The mode is available in 3 variants: simple, extended and deferred:

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(treemacs-git-mode 'deferred) 
#+END_SRC
 

** make treemacs open on emacs startup
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(add-hook 'after-init-hook 'treemacs)
#+END_SRC


* Neotree

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'neotree)
#+END_SRC

** neotree 'icons' theme, which supports filetype icons
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
    ;; (after 'neotree
  ;; (setq neo-theme (if (display-graphic-p) 'icons))

    (setq neo-theme 'icons)
#+END_SRC


** set NeoTree default window width
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(setq neo-window-width 32)
#+END_SRC

** toggle neotree with F8
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(global-set-key [f7] 'neotree-toggle)
#+END_SRC


** make nerdtree open on emacs startup
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  ;; (add-hook 'after-init-hook #'neotree-toggle)
#+END_SRC




** make neotree window open and go the file currently opened
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(setq neo-smart-open t)
#+END_SRC


** solve keybinding conflicts between neotree with evil mode
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (add-hook 'neotree-mode-hook
            (lambda ()
              ; default Neotree bindings
              (define-key evil-normal-state-local-map (kbd "TAB") 'neotree-enter)
              (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
              (define-key evil-normal-state-local-map (kbd "q") 'neotree-hide)
              (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
              (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
              (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
              (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
              (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)
              (define-key evil-normal-state-local-map (kbd "|") 'neotree-enter-vertical-split)
              (define-key evil-normal-state-local-map (kbd "-") 'neotree-enter-horizontal-split)
              ; simulating NERDTree bindings in Neotree
              (define-key evil-normal-state-local-map (kbd "R") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "r") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "u") 'neotree-refresh)
              (define-key evil-normal-state-local-map (kbd "C") 'neotree-change-root)
              (define-key evil-normal-state-local-map (kbd "c") 'neotree-create-node)))
#+END_SRC



* dired-sidebar

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'neotree)
#+END_SRC

** toggle neotree with F8
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(global-set-key [f6] 'dired-sidebar-toggle-sidebar)
#+END_SRC

** other settings for dired-sidebar
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(setq dired-sidebar-subtree-line-prefix "__")
(setq dired-sidebar-theme 'vscode)
(setq dired-sidebar-use-term-integration t)
(setq dired-sidebar-use-custom-font t)
#+END_SRC

* eyebrowse (window navigation)
  
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
(require 'eyebrowse)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  ;; (eyebrowse-mode t)
#+END_SRC
  

* Shell
  
** System Shell
*** Make system shell open in a split-window buffer at the bottom of the screen
   
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (defun /shell/new-window ()
       "Opens up a new shell in the directory associated with the current buffer's file." 
       (interactive)
       (let* ((parent (if (buffer-file-name)
                          (file-name-directory (buffer-file-name))
                        default-directory))
              (height (/ (window-total-height) 3))
              (name   (car (last (split-string parent "/" t)))))
         (split-window-vertically (- height))
         (other-window 1)
         (shell "new")
         (rename-buffer (concat "*shell: " name "*"))

         (insert (concat "ls"))
         ))

   ; Pull system shell in a new bottom window
   (define-key evil-normal-state-map (kbd "\"") #'/shell/new-window)
   (define-key evil-visual-state-map (kbd "\"") #'/shell/new-window)
   (define-key evil-motion-state-map (kbd "\"") #'/shell/new-window)
 #+END_SRC

  
** Eshell

*** Make eshell open in a split-window buffer at the bottom of the screen
   
 #+BEGIN_SRC emacs-lisp :tangle init.el
 (defun /eshell/new-window ()
     "Opens up a new eshell in the directory associated with the current buffer's file.  The eshell is renamed to match that directory to make multiple eshell windows easier."
     (interactive)
     (let* ((parent (if (buffer-file-name)
                        (file-name-directory (buffer-file-name))
                      default-directory))
            (height (/ (window-total-height) 3))
            (name   (car (last (split-string parent "/" t)))))
       (split-window-vertically (- height))
       (other-window 1)
       (eshell "new")
       (rename-buffer (concat "*eshell: " name "*"))

       (insert (concat "ls"))
       (eshell-send-input)))

 ; Pull eshell in a new bottom window
 (define-key evil-normal-state-map (kbd "!") #'/eshell/new-window)
 (define-key evil-visual-state-map (kbd "!") #'/eshell/new-window)
 (define-key evil-motion-state-map (kbd "!") #'/eshell/new-window)
 #+END_SRC

 


* PDF Tools

** Install pdf-tools if its not already installed
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (pdf-tools-install)
  ;; the docs say if i care about startup time, i should use pdf-loader-install instead of pdf-tools-install, but doenst say why
  ;; (pdf-loader-install) 
#+END_SRC

** Make buffer refresh every 1 second to PDF-tools updates the changed pdf
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  ;; (add-hook 'pdf-view-mode-hook 'auto-revert-mode) 
  ;; (add-hook 'doc-view-mode-hook 'auto-revert-mode) 
#+END_SRC

** PDF tools evil keybindings
#+BEGIN_SRC emacs-lisp :tangle init.el
  (evil-define-key 'normal pdf-view-mode-map
    "h" 'pdf-view-previous-page-command
    "j" (lambda () (interactive) (pdf-view-next-line-or-next-page 5))
    "k" (lambda () (interactive) (pdf-view-previous-line-or-previous-page 5))
    "l" 'pdf-view-next-page-command)
#+END_SRC



* Appearance

** Applying my theme
   
#+BEGIN_SRC emacs-lisp :tangle init.el

  (add-to-list 'custom-theme-load-path "~/dotfiles/emacs.d/themes/")
  ; theme options:
  ; atom-one-dark (doenst work well with emacsclient, ugly blue bg)
  ; dracula
  ; darktooth
  ; gruvbox-dark-hard
  ; gruvbox-dark-light
  ; gruvbox-dark-medium
  ; base16-default-dark-theme <-- this one is good

  (setq my-theme 'darkplus)
  
#+END_SRC

Load the theme

#+BEGIN_SRC emacs-lisp :tangle init.el
 (load-theme my-theme t)
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle init.el

  ;; (defun load-my-theme (frame)
  ;;   "Function to load the theme in current FRAME.
  ;;   sed in conjunction
  ;;   with bellow snippet to load theme after the frame is loaded
  ;;   to avoid terminal breaking theme."
  ;;   (select-frame frame)
  ;;   (load-theme my-theme t))

  ;; ; make emacs load the theme after loading the frame
  ;; ; resolves issue with the theme not loading properly in terminal mode on emacsclient

  ;; ;; this if was breaking my emacs!!!!!
  ;;  (add-hook 'after-make-frame-functions #'load-my-theme)
#+END_SRC


