emacs.d/emacs.tex

\subsection*{treemacs-git-mode}
\label{sec:orgf613e03}
`treemacs-git-mode` is a global minor mode which enables treemacs to check for files’ and directories’ git status information and highlight them accordingly (see also the treemacs-git-\ldots{} faces). The mode is available in 3 variants: simple, extended and deferred:

\begin{verbatim}
(treemacs-git-mode 'deferred) 
\end{verbatim}


\subsection*{make treemacs open on emacs startup}
\label{sec:org6ff7d9a}
\begin{verbatim}
(add-hook 'after-init-hook 'treemacs)
\end{verbatim}


\section*{Neotree}
\label{sec:org494f5b3}

\begin{verbatim}
(require 'neotree)
\end{verbatim}

\subsection*{neotree 'icons' theme, which supports filetype icons}
\label{sec:org4fa32e6}
\begin{verbatim}
  ;; (after 'neotree
;; (setq neo-theme (if (display-graphic-p) 'icons))

  (setq neo-theme 'icons)
\end{verbatim}


\subsection*{set NeoTree default window width}
\label{sec:orgf0462c3}
\begin{verbatim}
(setq neo-window-width 32)
\end{verbatim}

\subsection*{toggle neotree with F8}
\label{sec:orga2d7a9b}
\begin{verbatim}
(global-set-key [f7] 'neotree-toggle)
\end{verbatim}


\subsection*{make nerdtree open on emacs startup}
\label{sec:org92ad762}
\begin{verbatim}
;; (add-hook 'after-init-hook #'neotree-toggle)
\end{verbatim}




\subsection*{make neotree window open and go the file currently opened}
\label{sec:orgdb77e4d}
\begin{verbatim}
(setq neo-smart-open t)
\end{verbatim}


\subsection*{solve keybinding conflicts between neotree with evil mode}
\label{sec:orge35949f}
\begin{verbatim}
(add-hook 'neotree-mode-hook
          (lambda ()
            ; default Neotree bindings
            (define-key evil-normal-state-local-map (kbd "TAB") 'neotree-enter)
            (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
            (define-key evil-normal-state-local-map (kbd "q") 'neotree-hide)
            (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
            (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
            (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
            (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
            (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
            (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)
            (define-key evil-normal-state-local-map (kbd "|") 'neotree-enter-vertical-split)
            (define-key evil-normal-state-local-map (kbd "-") 'neotree-enter-horizontal-split)
            ; simulating NERDTree bindings in Neotree
            (define-key evil-normal-state-local-map (kbd "R") 'neotree-refresh)
            (define-key evil-normal-state-local-map (kbd "r") 'neotree-refresh)
            (define-key evil-normal-state-local-map (kbd "u") 'neotree-refresh)
            (define-key evil-normal-state-local-map (kbd "C") 'neotree-change-root)
            (define-key evil-normal-state-local-map (kbd "c") 'neotree-create-node)))
\end{verbatim}



\section*{eyebrowse (window navigation)}
\label{sec:orgc38dc53}

\begin{verbatim}
(require 'eyebrowse)
\end{verbatim}

\begin{verbatim}
;; (eyebrowse-mode t)
\end{verbatim}


\section*{Shell}
\label{sec:org6850658}

\subsection*{System Shell}
\label{sec:orgb9070ed}
\subsubsection*{Make system shell open in a split-window buffer at the bottom of the screen}
\label{sec:org87f24c9}

\begin{verbatim}
(defun /shell/new-window ()
    "Opens up a new shell in the directory associated with the current buffer's file." 
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (height (/ (window-total-height) 3))
           (name   (car (last (split-string parent "/" t)))))
      (split-window-vertically (- height))
      (other-window 1)
      (shell "new")
      (rename-buffer (concat "*shell: " name "*"))

      (insert (concat "ls"))
      ))

; Pull system shell in a new bottom window
(define-key evil-normal-state-map (kbd "\"") #'/shell/new-window)
(define-key evil-visual-state-map (kbd "\"") #'/shell/new-window)
(define-key evil-motion-state-map (kbd "\"") #'/shell/new-window)
\end{verbatim}


\subsection*{Eshell}
\label{sec:org6d20c27}

\subsubsection*{Make eshell open in a split-window buffer at the bottom of the screen}
\label{sec:org676b10d}

\begin{verbatim}
(defun /eshell/new-window ()
    "Opens up a new eshell in the directory associated with the current buffer's file.  The eshell is renamed to match that directory to make multiple eshell windows easier."
    (interactive)
    (let* ((parent (if (buffer-file-name)
                       (file-name-directory (buffer-file-name))
                     default-directory))
           (height (/ (window-total-height) 3))
           (name   (car (last (split-string parent "/" t)))))
      (split-window-vertically (- height))
      (other-window 1)
      (eshell "new")
      (rename-buffer (concat "*eshell: " name "*"))

      (insert (concat "ls"))
      (eshell-send-input)))

; Pull eshell in a new bottom window
(define-key evil-normal-state-map (kbd "!") #'/eshell/new-window)
(define-key evil-visual-state-map (kbd "!") #'/eshell/new-window)
(define-key evil-motion-state-map (kbd "!") #'/eshell/new-window)
\end{verbatim}




\section*{PDF Tools}
\label{sec:org9ffc18b}

\subsection*{Install pdf-tools if its not already installed}
\label{sec:org86a9212}
\begin{verbatim}
;; (pdf-tools-install)
;; the docs say if i care about startup time, i should use pdf-loader-install instead of pdf-tools-install, but doenst say why
;; (pdf-loader-install) 
\end{verbatim}

\subsection*{Make buffer refresh every 1 second to PDF-tools updates the changed pdf}
\label{sec:orgf95922d}
\begin{verbatim}
(add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
;; (add-hook 'pdf-view-mode-hook 'auto-revert-mode) 
;; (add-hook 'doc-view-mode-hook 'auto-revert-mode) 
\end{verbatim}

\subsection*{PDF tools evil keybindings}
\label{sec:orgcbd8127}
\begin{verbatim}
(evil-define-key 'normal pdf-view-mode-map
  "h" 'pdf-view-previous-page-command
  "j" (lambda () (interactive) (pdf-view-next-line-or-next-page 5))
  "k" (lambda () (interactive) (pdf-view-previous-line-or-previous-page 5))
  "l" 'pdf-view-next-page-command)
\end{verbatim}



\section*{Appearance}
\label{sec:org98afe30}

\subsection*{Applying my theme}
\label{sec:org2c88349}

\begin{verbatim}

(add-to-list 'custom-theme-load-path "~/dotfiles/emacs.d/themes/")
; theme options:
; atom-one-dark (doenst work well with emacsclient, ugly blue bg)
; dracula
; darktooth
; gruvbox-dark-hard
; gruvbox-dark-light
; gruvbox-dark-medium
; base16-default-dark-theme <-- this one is good

(setq my-theme 'doom-tomorrow-night)

\end{verbatim}

Load the theme

\begin{verbatim}
(load-theme my-theme t)
\end{verbatim}


\begin{verbatim}

;; (defun load-my-theme (frame)
;;   "Function to load the theme in current FRAME.
;;   sed in conjunction
;;   with bellow snippet to load theme after the frame is loaded
;;   to avoid terminal breaking theme."
;;   (select-frame frame)
;;   (load-theme my-theme t))

;; ; make emacs load the theme after loading the frame
;; ; resolves issue with the theme not loading properly in terminal mode on emacsclient

;; ;; this if was breaking my emacs!!!!!
;;  (add-hook 'after-make-frame-functions #'load-my-theme)
\end{verbatim}
