emacs.d/emacs.org
** doom-modeline
   
Require and enable the doom-modeline
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'doom-modeline)
(doom-modeline-mode 1)
#+END_SRC

Don’t compact font caches during GC (garbage collection). 
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (setq inhibit-compacting-font-caches t)
#+END_SRC

Customize the doom-modeline (convert the comments to org later

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; How tall the mode-line should be. It's only respected in GUI.
  ;; If the actual char height is larger, it respects the actual height.
  (setq doom-modeline-height 23)

  ;; How wide the mode-line bar should be. It's only respected in GUI.
  (setq doom-modeline-bar-width 3)

  ;; Determines the style used by `doom-modeline-buffer-file-name'.
  ;;
  ;; Given ~/Projects/FOSS/emacs/lisp/comint.el
  ;;   truncate-upto-project => ~/P/F/emacs/lisp/comint.el
  ;;   truncate-from-project => ~/Projects/FOSS/emacs/l/comint.el
  ;;   truncate-with-project => emacs/l/comint.el
  ;;   truncate-except-project => ~/P/F/emacs/l/comint.el
  ;;   truncate-upto-root => ~/P/F/e/lisp/comint.el
  ;;   truncate-all => ~/P/F/e/l/comint.el
  ;;   relative-from-project => emacs/lisp/comint.el
  ;;   relative-to-project => lisp/comint.el
  ;;   file-name => comint.el
  ;;   buffer-name => comint.el<2> (uniquify buffer name)
  ;;
  ;; If you are expereicing the laggy issue, especially while editing remote files
  ;; with tramp, please try `file-name' style.
  ;; Please refer to https://github.com/bbatsov/projectile/issues/657.
  (setq doom-modeline-buffer-file-name-style 'truncate-upto-project)

  ;; Whether display icons in mode-line or not.
  (setq doom-modeline-icon t)

  ;; Whether display the icon for major mode. It respects `doom-modeline-icon'.
  (setq doom-modeline-major-mode-icon t)

  ;; Whether display color icons for `major-mode'. It respects
  ;; `doom-modeline-icon' and `all-the-icons-color-icons'.
  (setq doom-modeline-major-mode-color-icon t)

  ;; Whether display icons for buffer states. It respects `doom-modeline-icon'.
  (setq doom-modeline-buffer-state-icon t)

  ;; Whether display buffer modification icon. It respects `doom-modeline-icon'
  ;; and `doom-modeline-buffer-state-icon'.
  (setq doom-modeline-buffer-modification-icon t)

  ;; Whether display minor modes in mode-line or not.
  (setq doom-modeline-minor-modes nil)

  ;; If non-nil, a word count will be added to the selection-info modeline segment.
  (setq doom-modeline-enable-word-count nil)

  ;; Whether display buffer encoding.
  (setq doom-modeline-buffer-encoding t)

  ;; Whether display indentation information.
  (setq doom-modeline-indent-info nil)

  ;; If non-nil, only display one number for checker information if applicable.
  (setq doom-modeline-checker-simple-format t)

  ;; The maximum displayed length of the branch name of version control.
  (setq doom-modeline-vcs-max-length 12)

  ;; Whether display perspective name or not. Non-nil to display in mode-line.
  (setq doom-modeline-persp-name t)

  ;; Whether display icon for persp name. Nil to display a # sign. It respects `doom-modeline-icon'
  (setq doom-modeline-persp-name-icon nil)

  ;; Whether display `lsp' state or not. Non-nil to display in mode-line.
  (setq doom-modeline-lsp t)

  ;; Whether display github notifications or not. Requires `ghub` package.
  (setq doom-modeline-github nil)

  ;; The interval of checking github.
  (setq doom-modeline-github-interval (* 30 60))

  ;; Whether display environment version or not
  (setq doom-modeline-env-version t)
  ;; Or for individual languages
  ;; (setq doom-modeline-env-enable-python t)
  ;; (setq doom-modeline-env-enable-ruby t)
  ;; (setq doom-modeline-env-enable-perl t)
  ;; (setq doom-modeline-env-enable-go t)
  ;; (setq doom-modeline-env-enable-elixir t)
  ;; (setq doom-modeline-env-enable-rust t)

  ;; Change the executables to use for the language version string
  (setq doom-modeline-env-python-executable "python")
  (setq doom-modeline-env-ruby-executable "ruby")
  (setq doom-modeline-env-perl-executable "perl")
  (setq doom-modeline-env-go-executable "go")
  (setq doom-modeline-env-elixir-executable "iex")
  (setq doom-modeline-env-rust-executable "rustc")

  ;; Whether display mu4e notifications or not. Requires `mu4e-alert' package.
  (setq doom-modeline-mu4e t)

  ;; Whether display irc notifications or not. Requires `circe' package.
  (setq doom-modeline-irc t)

  ;; Function to stylize the irc buffer names.
  (setq doom-modeline-irc-stylize 'identity)
#+END_SRC


this was commented with C-c ; so it doenst get exported in favor of doom-modeline 
** COMMENT smart-mode-line
   
#+BEGIN_SRC emacs-lisp :tangle init.el
 (require 'smart-mode-line)
 (if (require 'smart-mode-line nil 'noerror)
     (progn
       ;( sml/name-width 20)
       ;( sml/mode-width 'full)
       ;( sml/shorten-directory t)
       ;( sml/shorten-modes t)
       (require 'smart-mode-line-powerline-theme)
       ; this must be BEFORE (sml/setup)
       (sml/apply-theme 'powerline)
       ;; Alternatives:
       ;; (sml/apply-theme 'powerline)
       ;; (sml/apply-theme 'dark)
       ;; (sml/apply-theme 'light)
       ;; (sml/apply-theme 'respectful)
       ;; (sml/apply-theme 'automatic)


       (if after-init-time
           (sml/setup)
         (add-hook 'after-init-hook 'sml/setup))


       (display-time-mode 1)
      
       (add-to-list 'sml/replacer-regexp-list '("^~/Dropbox/" ":DB:"))
       (add-to-list 'sml/replacer-regexp-list
                    '("^~/.*/lib/ruby/gems" ":GEMS" ))
       (add-to-list 'sml/replacer-regexp-list
                    '("^~/Projects/" ":CODE:"))))
#+END_SRC

** parrot-mode
   
Enable the party parrot
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'parrot)
;; To see the party parrot in the modeline, turn on parrot mode:
(parrot-mode)  
#+END_SRC


Rotation function keybindings for vanilla emacs
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-set-key (kbd "C-c p") 'parrot-rotate-prev-word-at-point)
(global-set-key (kbd "C-c n") 'parrot-rotate-next-word-at-point)
#+END_SRC

Rotation function keybindings for evil users
#+BEGIN_SRC emacs-lisp :tangle init.el
(define-key evil-normal-state-map (kbd "[r") 'parrot-rotate-prev-word-at-point)
(define-key evil-normal-state-map (kbd "]r") 'parrot-rotate-next-word-at-point)
#+END_SRC

Type of parrots available:

- default
- confused
- emacs
- nyan
- rotating
- science
- thumbsup

#+BEGIN_SRC emacs-lisp :tangle init.el
(parrot-set-parrot-type 'default)
#+END_SRC

Seconds between animation frames (can be a decimal number)
#+BEGIN_SRC emacs-lisp :tangle init.el
; parrot-animation-frame-interval  
#+END_SRC

Minimum width of the window, below which party parrot mode will be disabled.
#+BEGIN_SRC emacs-lisp :tangle init.el
; parrot-minimum-window-width 
#+END_SRC


To enable parrot animation, nil for a static image.
#+BEGIN_SRC emacs-lisp :tangle init.el
; (parrot-animate-parrot t) 
#+END_SRC

Number of spaces of padding before and after the parrot.
#+BEGIN_SRC emacs-lisp :tangle init.el
; parrot-spaces-before 
; parrot-spaces-after
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
; - number of times the parrot will cycle through its gif.
parrot-num-rotations 
#+END_SRC


Add hook to mu4e so the parrot rotates when new email arrives
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'mu4e-index-updated-hook #'parrot-start-animation)
#+END_SRC

Rotate the parrot when clicking on it (this can also be used to execute any function when clicking the parrot, like 'flyspell-buffer)
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'parrot-click-hook #'parrot-start-animation)
#+END_SRC

Rotate parrot when buffer is saved
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'after-save-hook #'parrot-start-animation)
#+END_SRC

** nyan-mode
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'nyan-mode)
(nyan-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; (setq nyan-cat-face-number 1)
#+END_SRC

I had to add this hook because setting nyan-animate-nyancat to t alone wasnt animating the cat
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'after-init-hook #'nyan-start-animation)
(setq nyan-animate-nyancat t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
(setq nyan-wavy-trail t)
#+END_SRC

