emacs.d/emacs.org
** solaire-mode
   
solaire-mode is an aesthetic plugin that helps visually distinguish file-visiting windows from other types of windows (like popups or sidebars) by giving them a slightly different -- often brighter -- background.

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'solaire-mode)
#+END_SRC

Enable solaire-mode anywhere it can be enabled
#+BEGIN_SRC emacs-lisp :tangle init.el
(solaire-global-mode +1)
#+END_SRC

To enable solaire-mode unconditionally for certain modes:
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'ediff-prepare-buffer-hook #'solaire-mode)
#+END_SRC


...if you use auto-revert-mode, this prevents solaire-mode from turning itself off every time Emacs reverts the file
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'after-revert-hook #'turn-on-solaire-mode)
#+END_SRC

highlight the minibuffer when it is activated:
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'minibuffer-setup-hook #'solaire-mode-in-minibuffer)
#+END_SRC

if the bright and dark background colors are the wrong way around, use this
to switch the backgrounds of the `default` and `solaire-default-face` faces.
This should be used *after* you load the active theme!

NOTE: This is necessary for themes in the doom-themes package!
#+BEGIN_SRC emacs-lisp :tangle init.el
(solaire-mode-swap-bg)
#+END_SRC

** cleaning the default UI
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq inhibit-splash-screen t)

(blink-cursor-mode t)
(setq blink-cursor-blinks 0) ;; blink forever
(setq-default indicate-empty-lines t)
(setq-default line-spacing 3)
(setq frame-title-format '("Emacs"))
#+END_SRC

*** Remove scroll bars from frames
#+BEGIN_SRC emacs-lisp :tangle init.el
(scroll-bar-mode -1)
#+END_SRC

*** Remove menu bar and tool bar
#+BEGIN_SRC emacs-lisp :tangle init.el
(tool-bar-mode -1)
(menu-bar-mode -1)
#+END_SRC


* centaur-tabs

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'centaur-tabs)
(centaur-tabs-mode t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
(global-set-key (kbd "C-<prior>")  'centaur-tabs-backward)
(global-set-key (kbd "C-<next>") 'centaur-tabs-forward)
(global-set-key [?\C-.] 'centaur-tabs-forward-tab)
(global-set-key (kbd "C-,") 'centaur-tabs-backward-tab)
#+END_SRC

** Tab Style for centaur-tabs
Types available: 
+ alternate
+ bar
+ box
+ chamfer
+ rounded
+ slang
+ wave
+ zigzag

#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-style "bar")
#+END_SRC

** Set the tabs height
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-height 32)
#+END_SRC

** Use custom icons on tabs from all-the-icons
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-set-icons t)
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-set-bar 'over)
#+END_SRC

** Gray out unselected tabs 
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-gray-out-icons 'buffer)
#+END_SRC

** Customize the modified marker
To display a marker indicating that a buffer has been modified (atom-style)
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-set-modified-marker t)
#+END_SRC

** To change the displayed string for the modified-marker
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq centaur-tabs-modified-marker "*")
#+END_SRC


** Enable vim-like tab motions
#+BEGIN_SRC emacs-lisp :tangle init.el
(define-key evil-normal-state-map (kbd "g t") 'centaur-tabs-forward)
(define-key evil-normal-state-map (kbd "g T") 'centaur-tabs-backward)
#+END_SRC



* Minor modes
  
** Highlighting stuff in code (numbers, operators and escape sequences)
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'prog-mode-hook 'highlight-numbers-mode)
(add-hook 'prog-mode-hook 'highlight-operators-mode)
(add-hook 'prog-mode-hook 'hes-mode)    ;; highlight escape sequences
#+END_SRC

** which-key

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'which-key)
  (setq which-key-idle-delay 0.2)
  (setq which-key-min-display-lines 3)
  (setq which-key-max-description-length 20)
  (setq which-key-max-display-columns 6)
  (which-key-mode)
#+END_SRC

** diff-hl (highlights uncommited diffs in bar aside from the line numbers)
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-diff-hl-mode)
#+END_SRC

** smartparens
   
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'smartparens-config)
(add-hook 'prog-mode-hook #'smartparens-mode)
#+END_SRC

*** evil-smartparens helps avoid conflicts between evil and smartparens

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
#+END_SRC

** rainbow mode
*** enable rainbow-mode on relevant filetypes

: Colorize hex, rgb and named color codes
   
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-hook 'org-mode-hook 'rainbow-mode)
   (add-hook 'css-mode-hook 'rainbow-mode)
   (add-hook 'php-mode-hook 'rainbow-mode)
   (add-hook 'html-mode-hook 'rainbow-mode)
   (add-hook 'web-mode-hook 'rainbow-mode)
   (add-hook 'js2-mode-hook 'rainbow-mode)
 #+END_SRC

** Emmet
    
*** Add hook to any markup file to load emmet-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
   (require 'emmet-mode)
#+END_SRC
 
*** Add hook to any markup file to load emmet-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
  (define-key evil-insert-state-map (kbd "TAB") 'emmet-expand-line)
#+END_SRC
 
*** Add hook to any markup file to load emmet-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
   (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
   (add-hook 'html-mode-hook 'emmet-mode) ;; Auto-start on HTML files
   (add-hook 'web-mode-hook 'emmet-mode) ;; Auto-start on web-mode
   (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation. 
#+END_SRC

*** Use emmet with JSX markup
#+BEGIN_SRC emacs-lisp :tangle init.el
   (setq emmet-expand-jsx-className? t) ;; default nil
#+END_SRC

** Smartscan mode
: Usage:
: M-n and M-p move between symbols
: M-' to replace all symbols in the buffer matching the one under point
: C-u M-' to replace symbols in your current defun only (as used by narrow-to-defun.)

#+BEGIN_SRC emacs-lisp :tangle init.el
  (smartscan-mode 1)
#+END_SRC 

* FlyCheck linter

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'after-init-hook #'global-flycheck-mode)
#+END_SRC

** Turn flycheck inline extension after flycheck starts
   
#+BEGIN_SRC emacs-lisp :tangle init.el
  (with-eval-after-load 'flycheck
    (global-flycheck-inline-mode))
  ;; (with-eval-after-load 'flycheck
  ;;   (add-hook 'flycheck-mode-hook #'turn-on-flycheck-inline))
#+END_SRC



* Languages Setup Web-Mode
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (require 'web-mode)
 #+END_SRC
 
*** web-mode script/code offset indentation (for JavaScript, Java, PHP, Ruby, Go, VBScript, Python, etc.)
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq web-mode-code-indent-offset 2)
#+END_SRC
  
** JavaScript
   
*** Associate Javascript files with js2-mode

: Use js2-mode for JS files  

 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'auto-mode-alist '("\\.js?\\'" . js2-mode))
 #+END_SRC
 
: Use js2-mode for Typescript files  

 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'auto-mode-alist '("\\.ts?\\'" . js2-mode))
 #+END_SRC
 
: Use js2-jsx-mode for JSX files  
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'auto-mode-alist '("\\.jsx?\\'" . js2-jsx-mode))
 #+END_SRC

*** PrettierJS

**** Require first so i can actually use it

  #+BEGIN_SRC emacs-lisp :tangle init.el
    (require 'prettier-js)
  #+END_SRC
  
**** add prettier to js2 and rjsx minor modes

#+BEGIN_SRC emacs-lisp :tangle init.el
     (add-hook 'js2-mode-hook 'prettier-js-mode)
     (add-hook 'json-mode-hook 'prettier-js-mode)
     (add-hook 'web-mode-hook 'prettier-js-mode)
     (add-hook 'rjsx-mode-hook 'prettier-js-mode)
#+END_SRC

