emacs.d/emacs.tex

\subsection*{solaire-mode}
\label{sec:org2cc4e4e}

solaire-mode is an aesthetic plugin that helps visually distinguish file-visiting windows from other types of windows (like popups or sidebars) by giving them a slightly different -- often brighter -- background.

\begin{verbatim}
(require 'solaire-mode)
\end{verbatim}

Enable solaire-mode anywhere it can be enabled
\begin{verbatim}
(solaire-global-mode +1)
\end{verbatim}

To enable solaire-mode unconditionally for certain modes:
\begin{verbatim}
(add-hook 'ediff-prepare-buffer-hook #'solaire-mode)
\end{verbatim}


\ldots{}if you use auto-revert-mode, this prevents solaire-mode from turning itself off every time Emacs reverts the file
\begin{verbatim}
(add-hook 'after-revert-hook #'turn-on-solaire-mode)
\end{verbatim}

highlight the minibuffer when it is activated:
\begin{verbatim}
(add-hook 'minibuffer-setup-hook #'solaire-mode-in-minibuffer)
\end{verbatim}

if the bright and dark background colors are the wrong way around, use this
to switch the backgrounds of the `default` and `solaire-default-face` faces.
This should be used \textbf{after} you load the active theme!

NOTE: This is necessary for themes in the doom-themes package!
\begin{verbatim}
(solaire-mode-swap-bg)
\end{verbatim}

\subsection*{cleaning the default UI}
\label{sec:org55301aa}

\begin{verbatim}
(setq inhibit-splash-screen t)

(blink-cursor-mode t)
(setq blink-cursor-blinks 0) ;; blink forever
(setq-default indicate-empty-lines t)
(setq-default line-spacing 3)
(setq frame-title-format '("Emacs"))
\end{verbatim}

\subsubsection*{Remove scroll bars from frames}
\label{sec:org90664c9}
\begin{verbatim}
(scroll-bar-mode -1)
\end{verbatim}

\subsubsection*{Remove menu bar and tool bar}
\label{sec:org46f5f53}
\begin{verbatim}
(tool-bar-mode -1)
(menu-bar-mode -1)
\end{verbatim}


\section*{centaur-tabs}
\label{sec:org50a7e1d}

\begin{verbatim}
(require 'centaur-tabs)
(centaur-tabs-mode t)
\end{verbatim}

\begin{verbatim}
(global-set-key (kbd "C-<prior>")  'centaur-tabs-backward)
(global-set-key (kbd "C-<next>") 'centaur-tabs-forward)
\end{verbatim}

\subsection*{Tab Style for centaur-tabs}
\label{sec:org0aa69d5}
Types available: 
\begin{itemize}
\item alternate
\item bar
\item box
\item chamfer
\item rounded
\item slang
\item wave
\item zigzag
\end{itemize}

\begin{verbatim}
(setq centaur-tabs-style "bar")
\end{verbatim}

\subsection*{Set the tabs height}
\label{sec:org53676d8}
\begin{verbatim}
(setq centaur-tabs-height 32)
\end{verbatim}

\subsection*{Use custom icons on tabs from all-the-icons}
\label{sec:orgec76008}
\begin{verbatim}
(setq centaur-tabs-set-icons t)
\end{verbatim}


\begin{verbatim}
(setq centaur-tabs-set-bar 'over)
\end{verbatim}

\subsection*{Gray out unselected tabs}
\label{sec:org55eff4a}
\begin{verbatim}
(setq centaur-tabs-gray-out-icons 'buffer)
\end{verbatim}

\subsection*{Customize the modified marker}
\label{sec:org8b77790}
To display a marker indicating that a buffer has been modified (atom-style)
\begin{verbatim}
(setq centaur-tabs-set-modified-marker t)
\end{verbatim}

\subsection*{To change the displayed string for the modified-marker}
\label{sec:org9e4fb30}
\begin{verbatim}
(setq centaur-tabs-modified-marker "*")
\end{verbatim}


\subsection*{Enable vim-like tab motions}
\label{sec:orgfd8d957}
\begin{verbatim}
(define-key evil-normal-state-map (kbd "g t") 'centaur-tabs-forward)
(define-key evil-normal-state-map (kbd "g T") 'centaur-tabs-backward)
\end{verbatim}



\section*{Minor modes}
\label{sec:org9de4594}

\subsection*{Highlighting stuff in code (numbers, operators and escape sequences)}
\label{sec:org1d28261}
\begin{verbatim}
(add-hook 'prog-mode-hook 'highlight-numbers-mode)
(add-hook 'prog-mode-hook 'highlight-operators-mode)
(add-hook 'prog-mode-hook 'hes-mode)    ;; highlight escape sequences
\end{verbatim}

\subsection*{which-key}
\label{sec:org2ec2d8a}

\begin{verbatim}
(require 'which-key)
(setq which-key-idle-delay 0.2)
(setq which-key-min-display-lines 3)
(setq which-key-max-description-length 20)
(setq which-key-max-display-columns 6)
(which-key-mode)
\end{verbatim}

\subsection*{diff-hl (highlights uncommited diffs in bar aside from the line numbers)}
\label{sec:org0f80897}
\begin{verbatim}
(global-diff-hl-mode)
\end{verbatim}

\subsection*{smartparens}
\label{sec:org14cce7e}

\begin{verbatim}
(require 'smartparens-config)
(add-hook 'prog-mode-hook #'smartparens-mode)
\end{verbatim}

\subsubsection*{evil-smartparens helps avoid conflicts between evil and smartparens}
\label{sec:orgd887e25}

\begin{verbatim}
(add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
\end{verbatim}

\subsection*{rainbow mode}
\label{sec:org6ebc8a4}
\subsubsection*{enable rainbow-mode on relevant filetypes}
\label{sec:org929656c}

\begin{verbatim}
Colorize hex, rgb and named color codes
\end{verbatim}


\begin{verbatim}
(add-hook 'org-mode-hook 'rainbow-mode)
(add-hook 'css-mode-hook 'rainbow-mode)
(add-hook 'php-mode-hook 'rainbow-mode)
(add-hook 'html-mode-hook 'rainbow-mode)
(add-hook 'web-mode-hook 'rainbow-mode)
(add-hook 'js2-mode-hook 'rainbow-mode)
\end{verbatim}

\subsection*{Emmet}
\label{sec:orge13a207}

\subsubsection*{Add hook to any markup file to load emmet-mode}
\label{sec:org8bcf0e6}
\begin{verbatim}
(add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
(add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation. 
\end{verbatim}

\subsubsection*{Use emmet with JSX markup}
\label{sec:orgbc50cab}
\begin{verbatim}
(setq emmet-expand-jsx-className? t) ;; default nil
\end{verbatim}

\subsection*{Smartscan mode}
\label{sec:orgb17194b}
\begin{verbatim}
Usage:
M-n and M-p move between symbols
M-' to replace all symbols in the buffer matching the one under point
C-u M-' to replace symbols in your current defun only (as used by narrow-to-defun.)
\end{verbatim}


\begin{verbatim}
(smartscan-mode 1)
\end{verbatim}

\section*{FlyCheck linter}
\label{sec:orgc078652}

\begin{verbatim}
(add-hook 'after-init-hook #'global-flycheck-mode)
\end{verbatim}

\subsection*{Turn flycheck inline extension after flycheck starts}
\label{sec:org05bd1d7}

\begin{verbatim}
(with-eval-after-load 'flycheck
  (global-flycheck-inline-mode))
;; (with-eval-after-load 'flycheck
;;   (add-hook 'flycheck-mode-hook #'turn-on-flycheck-inline))
\end{verbatim}



\section*{Languages Setup}
\label{sec:orge00b4c0}

\subsection*{web mode}
\label{sec:org040cbce}

\subsubsection*{Require Web-Mode}
\label{sec:orgadfe77f}
\begin{verbatim}
(require 'web-mode)
\end{verbatim}

\subsubsection*{web-mode script/code offset indentation (for JavaScript, Java, PHP, Ruby, Go, VBScript, Python, etc.)}
\label{sec:org2fa8f84}
\begin{verbatim}
(setq web-mode-code-indent-offset 2)
\end{verbatim}

\subsection*{JavaScript}
\label{sec:org5378f6e}

\subsubsection*{Associate Javascript files with js2-mode}
\label{sec:org6f29420}

\begin{verbatim}
Use js2-mode for JS files  
\end{verbatim}


\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.js?\\'" . js2-mode))
\end{verbatim}

\begin{verbatim}
Use js2-mode for Typescript files  
\end{verbatim}


\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.ts?\\'" . js2-mode))
\end{verbatim}

\begin{verbatim}
Use js2-jsx-mode for JSX files  
\end{verbatim}

\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.jsx?\\'" . js2-jsx-mode))
\end{verbatim}

\subsubsection*{PrettierJS}
\label{sec:org2d6060b}

\begin{itemize}
\item Require first so i can actually use it
\label{sec:orgf35e3dc}

\begin{verbatim}
(require 'prettier-js)
\end{verbatim}

\item add prettier to js2 and rjsx minor modes
\label{sec:org813bf63}

\begin{verbatim}
(add-hook 'js2-mode-hook 'prettier-js-mode)
(add-hook 'web-mode-hook 'prettier-js-mode)
(add-hook 'rjsx-mode-hook 'prettier-js-mode)
\end{verbatim}
