emacs.d/emacs.org
**** Add prettier to Web-Mode
#+BEGIN_SRC emacs-lisp :tangle init.el
   (defun enable-minor-mode (my-pair)
     "Enable minor mode if filename match the regexp.  MY-PAIR is a cons cell (regexp . minor-mode)."
     (if (buffer-file-name)
         (if (string-match (car my-pair) buffer-file-name)
         (funcall (cdr my-pair)))))
#+END_SRC

***** And then hook to web-mode like this:

#+BEGIN_SRC emacs-lisp :tangle init.el
   (add-hook 'web-mode-hook #'(lambda ()
                               (enable-minor-mode
                                '("\\.js?\\'" . prettier-js-mode)
                                '("\\.jsx?\\'" . prettier-js-mode)
                                '("\\.css?\\'" . prettier-js-mode))))
#+END_SRC

*** js2-refactor
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-hook 'js2-mode-hook #'js2-refactor-mode)
 #+END_SRC


**** choose js2-refactor keybinding scheme (this can be changed easily)

 #+BEGIN_SRC emacs-lisp :tangle init.el
   (js2r-add-keybindings-with-prefix "C-c C-m")
 #+END_SRC

** Elixir
   
: This elixir part of the config compiles to a separate files, inside the config folder, named `elixir.tau.el`
   
*** Install elixir-mode if not already installed
    
 #+BEGIN_SRC emacs-lisp :tangle config/elixir.tau.el
   (unless (package-installed-p 'elixir-mode)
   (package-install 'elixir-mode))  
 #+END_SRC

*** Require elixir-mode
    
 #+BEGIN_SRC emacs-lisp :tangle config/elixir.tau.el
 (require 'elixir-mode)
 #+END_SRC

*** Elixir file types associations
#+BEGIN_SRC emacs-lisp :tangle config/elixir.tau.el
(add-to-list 'auto-mode-alist '("\\.ex\\'" . elixir-mode))
(add-to-list 'auto-mode-alist '("\\.exs\\'" . elixir-mode))
;; Use web-mode for elixir template files (eex)
(add-to-list 'auto-mode-alist '("\\.eex\\'" . web-mode))
#+END_SRC

*** Create a buffer-local hook to run elixir-format on save, only when we enable elixir-mode.
   
#+BEGIN_SRC emacs-lisp :tangle config/elixir.tau.el
  (add-hook 'elixir-mode-hook
            (lambda () (add-hook 'before-save-hook 'elixir-format nil t)))
#+END_SRC
          

*** Alchemist
   
**** Install Alchemist if already not installed
 #+BEGIN_SRC emacs-lisp :tangle config/elixir.tau.el
 (unless (package-installed-p 'alchemist)
   (package-install 'alchemist)) 
 #+END_SRC

** Ruby
   
: This Ruby part of the config compiles to a separate file, inside the config folder, called `ruby.tau.el`
 
*** Associate common Ruby files with  enh-ruby-mode
#+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
(add-to-list 'auto-mode-alist
             '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))
#+END_SRC
*** Require enhanced-ruby major mode replacement for native ruby-mode
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
   (require 'enh-ruby-mode)
 #+END_SRC

*** this bellow is optional, i only use it because it complains about not finding ruby in /usr/local/bin
 "This is also easily solvable by creating a symbolic link to the ruby shim to /usr/local/bin/ruby
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (setq enh-ruby-program "~/.rbenv/shims/ruby") ; so that still works if ruby points to ruby1.8
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (setq-default
   ruby-use-encoding-map nil
   ruby-insert-encoding-magic-comment nil)
 #+END_SRC

*** Enable superword-mode for enh-ruby-mode 
 It change all cursor movement/edit commands to stop in-between the “camelCase” words.

 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (add-hook 'enh-ruby-mode-hook 'superword-mode)
 #+END_SRC

*** Enhanced Ruby Mode defines its own specific faces with the hook erm-define-faces. If your theme is already defining those faces, to not overwrite them, just remove the hook with:
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (remove-hook 'enh-ruby-mode-hook 'erm-define-faces)
 #+END_SRC


 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (after 'page-break-lines
             (push 'ruby-mode page-break-lines-modes))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (require 'rspec-mode)
 #+END_SRC

*** Inferior ruby
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (require 'inf-ruby)
 (add-hook 'enh-ruby-mode-hook 'inf-ruby-minor-mode)
 #+END_SRC

*** Ruby compilation
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (require 'ruby-compilation)

 (after 'enh-ruby-mode
             (let ((m ruby-mode-map))
               (define-key m [S-f7] 'ruby-compilation-this-buffer)
               (define-key m [f7] 'ruby-compilation-this-test)))

 (after 'ruby-compilation
             (defalias 'rake 'ruby-compilation-rake))
 #+END_SRC

*** COMMENT Robe mode
 Dependencies:   
 - opry
 - pry-doc >= 0.6.0 (on MRI)
 - method_source >= 0.8.2 (for compatibility with the latest Rubinius)

 /Note that if your project is using Bundler, the dependencies have to be added to the Gemfile./
**** Enable robe-mode upon enh-ruby-mode
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (add-hook 'enh-ruby-mode-hook 'robe-mode)   
 #+END_SRC

**** Company completion for Robe
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (eval-after-load 'company
   '(push 'company-robe company-backends))
 #+END_SRC

**** native autocomplete with robe
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (add-hook 'robe-mode-hook 'ac-robe-setup)
 #+END_SRC

*** ri support
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 ;; (require 'yari)
 ;; (defalias 'ri 'yari)
 #+END_SRC



 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
   ;; (require 'goto-gem)
 #+END_SRC


 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (require 'bundler)
 #+END_SRC


 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
   ;; (when (maybe-require 'yard-mode)
   ;;   (add-hook 'ruby-mode-hook 'yard-mode)
   ;;   (add-hook 'enh-ruby-mode-hook 'yard-mode)
   ;;   (after 'yard-mode
   ;;               (diminish 'yard-mode)))
 #+END_SRC

*** Rubocop
 #+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
 (require 'rubocop)
 #+END_SRC

** Go

*** Enable go-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'go-mode)
(autoload 'go-mode "go-mode" "Major mode for editing Go code." t)

#+END_SRC

*** Associate Go files with go-mode
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode))
 #+END_SRC

** Elm 
*** Company backend for elm
#+BEGIN_SRC emacs-lisp :tangle init.el

(with-eval-after-load 'company
  (add-to-list 'company-backends 'company-elm))

#+END_SRC

** Haskell
 #+BEGIN_SRC emacs-lisp :tangle init.el
 (add-hook 'haskell-mode-hook #'flycheck-haskell-setup)
 ; ; (require 'haskell-interactive-mode)
 ; (add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
 ; (eval-after-load 'flycheck
 ;                  '(add-hook 'flycheck-mode-hook #'flycheck-haskell-setup))
 ; (add-hook 'haskell-mode-hook (lambda ()
 ;                                (electric-indent-mode -1)))
 ; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
 ; (add-hook 'haskell-mode-hook (lambda () (global-set-key (kbd "<f5>") 'haskell-process-cabal-build)))
 #+END_SRC
 
** PHP

 : Use web-mode for PHP files  

 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'auto-mode-alist '("\\.php?\\'" . web-mode))
   (add-to-list 'auto-mode-alist '("\\.inc?\\'" . web-mode))
 #+END_SRC

** HTML
   
*** Associate HTML with web-mode   

 #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
   (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
 #+END_SRC
 
*** HTML element offset indentation
#+BEGIN_SRC emacs-lisp :tangle init.el
 (setq web-mode-markup-indent-offset 4)
#+END_SRC

** CSS   

*** Open CSS files with web-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
#+END_SRC

*** CSS offset indentation
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq web-mode-css-indent-offset 2)
#+END_SRC

** YAML
  
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (require 'yaml-mode)
   (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
 #+END_SRC


