emacs.d/emacs.tex

\item Add prettier to Web-Mode
\label{sec:org1a46a6e}
\begin{verbatim}
(defun enable-minor-mode (my-pair)
  "Enable minor mode if filename match the regexp.  MY-PAIR is a cons cell (regexp . minor-mode)."
  (if (buffer-file-name)
      (if (string-match (car my-pair) buffer-file-name)
      (funcall (cdr my-pair)))))
\end{verbatim}

\begin{itemize}
\item And then hook to web-mode like this:
\label{sec:orgca8b13f}

\begin{verbatim}
(add-hook 'web-mode-hook #'(lambda ()
                            (enable-minor-mode
                             '("\\.js?\\'" . prettier-js-mode)
                             '("\\.jsx?\\'" . prettier-js-mode)
                             '("\\.css?\\'" . prettier-js-mode))))
\end{verbatim}
\end{itemize}
\end{itemize}

\subsubsection*{js2-refactor}
\label{sec:org16e240a}
\begin{verbatim}
(add-hook 'js2-mode-hook #'js2-refactor-mode)
\end{verbatim}


\begin{itemize}
\item choose js2-refactor keybinding scheme (this can be changed easily)
\label{sec:orgf7a49f5}

\begin{verbatim}
(js2r-add-keybindings-with-prefix "C-c C-m")
\end{verbatim}
\end{itemize}

\subsection*{Elixir}
\label{sec:orgfc30dfa}

\begin{verbatim}
This elixir part of the config compiles to a separate files, inside the config folder, named `elixir.tau.el`
\end{verbatim}

\subsubsection*{Install elixir-mode if not already installed}
\label{sec:org9daae4d}

\begin{verbatim}
(unless (package-installed-p 'elixir-mode)
(package-install 'elixir-mode))  
\end{verbatim}

\subsubsection*{Require elixir-mode}
\label{sec:org695eb38}

\begin{verbatim}
(require 'elixir-mode)
\end{verbatim}

\subsubsection*{Elixir file types associations}
\label{sec:orgb6a5f4b}
\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.ex\\'" . elixir-mode))
(add-to-list 'auto-mode-alist '("\\.exs\\'" . elixir-mode))
;; Use web-mode for elixir template files (eex)
(add-to-list 'auto-mode-alist '("\\.eex\\'" . web-mode))
\end{verbatim}

\subsubsection*{Create a buffer-local hook to run elixir-format on save, only when we enable elixir-mode.}
\label{sec:orgcce3a7b}

\begin{verbatim}
(add-hook 'elixir-mode-hook
          (lambda () (add-hook 'before-save-hook 'elixir-format nil t)))
\end{verbatim}


\subsubsection*{Alchemist}
\label{sec:orgf313a4e}

\begin{itemize}
\item Install Alchemist if already not installed
\label{sec:org9af99af}
\begin{verbatim}
(unless (package-installed-p 'alchemist)
  (package-install 'alchemist)) 
\end{verbatim}
\end{itemize}

\subsection*{Ruby}
\label{sec:org95a1383}

\begin{verbatim}
This Ruby part of the config compiles to a separate file, inside the config folder, called `ruby.tau.el`
\end{verbatim}

\subsubsection*{Associate common Ruby files with  enh-ruby-mode}
\label{sec:orgbb02eea}
\begin{verbatim}
(add-to-list 'auto-mode-alist
             '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))
\end{verbatim}
\subsubsection*{Require enhanced-ruby major mode replacement for native ruby-mode}
\label{sec:orgbc415b7}
\begin{verbatim}
(require 'enh-ruby-mode)
\end{verbatim}

\subsubsection*{this bellow is optional, i only use it because it complains about not finding ruby in /usr/local/bin}
\label{sec:org62103bc}
``This is also easily solvable by creating a symbolic link to the ruby shim to /usr/local/bin/ruby
\begin{verbatim}
(setq enh-ruby-program "~/.rbenv/shims/ruby") ; so that still works if ruby points to ruby1.8
\end{verbatim}

\begin{verbatim}
(setq-default
  ruby-use-encoding-map nil
  ruby-insert-encoding-magic-comment nil)
\end{verbatim}

\subsubsection*{Enable superword-mode for enh-ruby-mode}
\label{sec:org086a047}
It change all cursor movement/edit commands to stop in-between the “camelCase” words.

\begin{verbatim}
(add-hook 'enh-ruby-mode-hook 'superword-mode)
\end{verbatim}

\subsubsection*{Enhanced Ruby Mode defines its own specific faces with the hook erm-define-faces. If your theme is already defining those faces, to not overwrite them, just remove the hook with:}
\label{sec:org89eefcd}
\begin{verbatim}
(remove-hook 'enh-ruby-mode-hook 'erm-define-faces)
\end{verbatim}


\begin{verbatim}
(after 'page-break-lines
            (push 'ruby-mode page-break-lines-modes))
\end{verbatim}

\begin{verbatim}
(require 'rspec-mode)
\end{verbatim}

\subsubsection*{Inferior ruby}
\label{sec:orgb7e83a7}
\begin{verbatim}
(require 'inf-ruby)
(add-hook 'enh-ruby-mode-hook 'inf-ruby-minor-mode)
\end{verbatim}

\subsubsection*{Ruby compilation}
\label{sec:orgab7d8cb}
\begin{verbatim}
(require 'ruby-compilation)

(after 'enh-ruby-mode
            (let ((m ruby-mode-map))
              (define-key m [S-f7] 'ruby-compilation-this-buffer)
              (define-key m [f7] 'ruby-compilation-this-test)))

(after 'ruby-compilation
            (defalias 'rake 'ruby-compilation-rake))
\end{verbatim}

\subsubsection*{ri support}
\label{sec:org87abdee}
\begin{verbatim}
;; (require 'yari)
;; (defalias 'ri 'yari)
\end{verbatim}



\begin{verbatim}
;; (require 'goto-gem)
\end{verbatim}


\begin{verbatim}
(require 'bundler)
\end{verbatim}


\begin{verbatim}
;; (when (maybe-require 'yard-mode)
;;   (add-hook 'ruby-mode-hook 'yard-mode)
;;   (add-hook 'enh-ruby-mode-hook 'yard-mode)
;;   (after 'yard-mode
;;               (diminish 'yard-mode)))
\end{verbatim}

\subsubsection*{Rubocop}
\label{sec:org3766029}
\begin{verbatim}
(require 'rubocop)
\end{verbatim}

\subsection*{Go}
\label{sec:org052f118}

\subsubsection*{Enable go-mode}
\label{sec:orgba97b4e}
\begin{verbatim}
(autoload 'go-mode "go-mode" "Major mode for editing Go code." t)
\end{verbatim}

\subsubsection*{Associate Go files with go-mode}
\label{sec:org20a3058}
\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode))
\end{verbatim}

\subsection*{Elm}
\label{sec:org7143fc9}
\subsubsection*{Company backend for elm}
\label{sec:org1af8320}
\begin{verbatim}

(with-eval-after-load 'company
  (add-to-list 'company-backends 'company-elm))

\end{verbatim}

\subsection*{Haskell}
\label{sec:org0027f85}
\begin{verbatim}
(add-hook 'haskell-mode-hook #'flycheck-haskell-setup)
; ; (require 'haskell-interactive-mode)
; (add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
; (eval-after-load 'flycheck
;                  '(add-hook 'flycheck-mode-hook #'flycheck-haskell-setup))
; (add-hook 'haskell-mode-hook (lambda ()
;                                (electric-indent-mode -1)))
; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
; (add-hook 'haskell-mode-hook (lambda () (global-set-key (kbd "<f5>") 'haskell-process-cabal-build)))
\end{verbatim}

\subsection*{PHP}
\label{sec:org91eabe1}

\begin{verbatim}
Use web-mode for PHP files  
\end{verbatim}


\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.php?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.inc?\\'" . web-mode))
\end{verbatim}

\subsection*{HTML}
\label{sec:org7abdef3}

\subsubsection*{Associate HTML with web-mode}
\label{sec:org8de5ce5}

\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
\end{verbatim}

\subsubsection*{HTML element offset indentation}
\label{sec:org11ee253}
\begin{verbatim}
(setq web-mode-markup-indent-offset 4)
\end{verbatim}

\subsection*{CSS}
\label{sec:org89aa09f}

\subsubsection*{Open CSS files with web-mode}
\label{sec:orge8c93b5}
\begin{verbatim}
(add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
\end{verbatim}

\subsubsection*{CSS offset indentation}
\label{sec:org9862038}
\begin{verbatim}
(setq web-mode-css-indent-offset 2)
\end{verbatim}

\subsection*{YAML}
\label{sec:org00badeb}

\begin{verbatim}
(require 'yaml-mode)
(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
\end{verbatim}
