emacs.d/emacs.org
*** Unlike python-mode, this mode follows the Emacs convention of not binding the ENTER key to `newline-and-indent'.  To get this behavior, add the key definition to `yaml-mode-hook':

 #+BEGIN_SRC emacs-lisp :tangle init.el
     (add-hook 'yaml-mode-hook
       '(lambda ()
         (define-key yaml-mode-map "\C-m" 'newline-and-indent))) 
 #+END_SRC

** LaTeX

 #+BEGIN_SRC emacs-lisp :tangle init.el
 (require 'ox-latex)
 #+END_SRC

*** AucTex settings

 #+BEGIN_SRC emacs-lisp :tangle init.el
 (require 'tex)
 #+END_SRC

 Three steps are required (as according to ORG official docs) to setup AucTex with Emacs:

**** 1) Tell emacs where the LaTeX related bins are located in the system

 #+BEGIN_SRC emacs-lisp :tangle init.el
 (setq exec-path (append exec-path '("/usr/bin/tex")))
 #+END_SRC

**** 2) Load AucTex
    
 #+BEGIN_SRC emacs-lisp :tangle init.el
   ;; (load "auctex.el" nil t t)
   ;; (load "preview-latex.el" nil t t)
 #+END_SRC

**** 3) Add Latex to list of org-babel loaded languages
    
 #+END_SRC
  #+BEGIN_SRC emacs-lisp :tangle init.el
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((latex . t)))
  #+END_SRC

  #+BEGIN_SRC emacs-lisp :tangle init.el
      (setq TeX-auto-save t)
      (setq TeX-parse-self t)
      (setq-default TeX-master nil)
  #+END_SRC


  #+BEGIN_SRC emacs-lisp :tangle init.el
      (add-hook 'LaTeX-mode-hook 'visual-line-mode)
      (add-hook 'LaTeX-mode-hook 'flyspell-mode)
      (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)   
  #+END_SRC




*** Latex Classes
**** Add the beamer presentation class template to org
  #+BEGIN_SRC emacs-lisp :tangle init.el
   (add-to-list 'org-latex-classes
	        '("beamer"
	          "\\documentclass\[presentation\]\{beamer\}"
	          ("\\section\{%s\}" . "\\section*\{%s\}")
	          ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
	          ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
  #+END_SRC


**** Add the memoir class template to org
    
 The Sections and Heading Levels gets configured as follows: 

     | Division       | <c>Level | <c>org-equivalent |
     | \book          |       -2 | *                 |
     | \part          |       -1 | **                |
     | \chapter       |        0 | ***               |
     | \section       |        1 | ****              |
     | \subsection    |        2 | *****             |
     | \subsubsection |        3 | ******            |
     | \paragraph     |        4 | *******           |
     | \subparagraph  |        5 | ********          |

    
 #+BEGIN_SRC emacs-lisp :tangle init.el
    (add-to-list 'org-latex-classes
                 '("memoir"
                   "\\documentclass\[a4paper\]\{memoir\}"
                   ("\\book\{%s\}" . "\\book*\{%s\}")
                   ("\\part\{%s\}" . "\\part*\{%s\}")
                   ("\\chapter\{%s\}" . "\\chapter*\{%s\}")
                   ("\\section\{%s\}" . "\\section*\{%s\}")
                   ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
                   ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
 #+END_SRC

**** Add abntex2 class to org list of latex classes
 This class is based on the Memoir class
 The Sections and Heading Levels gets configured as follows: 

     | Division       | <c>Level | <c>org-equivalent |
     | \part          |       -1 | *                 |
     | \chapter       |        0 | **                |
     | \section       |        1 | ***               |
     | \subsection    |        2 | ****              |
     | \subsubsection |        3 | *****             |
     | \paragraph     |        4 | ******            |
     | \subparagraph  |        5 | *******           |
 #+BEGIN_SRC emacs-lisp :tangle init.el
    (add-to-list 'org-latex-classes
                '("abntex2"
                  "\\documentclass\[a4paper,oneside,12pt\]\{abntex2\}"
                  ("\\chapter\{%s\}" . "\\chapter*\{%s\}")
                  ("\\section\{%s\}" . "\\section*\{%s\}")
                  ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
                  ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")
                  ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")
                  ("\\paragraph\{%s\}" . "\\paragraph*\{%s\}")))
 #+END_SRC

 
*** Enable latex-preview-pane
 #+BEGIN_SRC emacs-lisp :tangle init.el
    (latex-preview-pane-enable)
 #+END_SRC

*** To compile documents to PDF by default add the following to your ~/.emacs.

 #+BEGIN_SRC emacs-lisp :tangle init.el
      (setq TeX-PDF-mode t)
 #+END_SRC

**** If it doesn’t work, try this :

 #+BEGIN_SRC emacs-lisp :tangle init.el
      (TeX-global-PDF-mode t)
 #+END_SRC


*** To highlight (or font-lock) the “\section{title}” lines:

 #+BEGIN_SRC emacs-lisp :tangle init.el
 (font-lock-add-keywords
    'latex-mode
    `((,(concat "^\\s-*\\\\\\("
                "\\(documentclass\\|\\(sub\\)?section[*]?\\)"
                "\\(\\[[^]% \t\n]*\\]\\)?{[-[:alnum:]_ ]+"
                "\\|"
                "\\(begin\\|end\\){document"
                "\\)}.*\n?")
       (0 'your-face append))))
 #+END_SRC


*** Convert quotes to LaTeX Smartquotes
   
 #+BEGIN_SRC emacs-lisp :tangle init.el
 (setq org-export-with-smart-quotes t)
 #+END_SRC

*** Keep latex logfiles
 #+BEGIN_SRC emacs-lisp :tangle init.el
 (setq org-latex-remove-logfiles nil)
 #+END_SRC

  
** Markdown
   
*** Enable markdown-mode
 #+BEGIN_SRC emacs-lisp :tangle init.el
   (autoload 'mardown-mode "markdown-mode")
   (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
 #+END_SRC

 
* Devops tools setup and helpers (dockerfile, netlify)
  
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'dockerfile-mode)
(add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)) 
#+END_SRC


* Autocompletion and Snippets
 
** LSP (language server protocol implementation for emacs) 
   
*** require and create lsp-mode hook for every programming language
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'lsp-mode)
(add-hook 'prog-mode-hook #'lsp) 
(add-hook 'enh-ruby-mode-hook #'lsp) 
(add-hook 'js2-mode-hook #'lsp) 
(add-hook 'js2-jsx-mode-hook #'lsp) 
#+END_SRC

*** lsp-ui

: This contains all the higher level UI modules of lsp-mode, like flycheck support and code lenses.

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'lsp-ui)
(add-hook 'lsp-mode-hook 'lsp-ui-mode)
#+END_SRC

*** company-lsp
    
: Company completion backend for lsp-mode. 

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'company-lsp)
(push 'company-lsp company-backends)
#+END_SRC

** Disable <RET> for autocomplete and leave on TAB
#+BEGIN_SRC emacs-lisp :tangle init.el
;; (define-key ac-completing-map [return] nil)
;; (define-key ac-completing-map "\r" nil)
#+END_SRC
  

** enable autocompletion engine
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'auto-complete)
(global-auto-complete-mode t)
#+END_SRC


** Company mode (Complete Anything)
   
*** Basic settings for company-mode
#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'company)
  (global-company-mode t)
  (setq company-tooltip-limit 20)                      ; bigger popup window
  (setq company-minimum-prefix-length 1)               ; start completing after 1st char typed
  (setq company-idle-delay .1)                         ; decrease delay before autocompletion popup shows
  (setq company-echo-delay 0)                          ; remove annoying blinking
  (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
  (setq company-dabbrev-downcase nil)                  ; Do not convert to lowercase
  (setq company-dabbrev-ignore-case t)
  (setq company-dabbrev-code-everywhere t)
  (setq company-selection-wrap-around t)               ; continue from top when reaching bottom
  (setq company-auto-complete 'company-explicit-action-p)
#+END_SRC

