emacs.d/emacs.tex


\subsubsection*{Unlike python-mode, this mode follows the Emacs convention of not binding the ENTER key to `newline-and-indent'.  To get this behavior, add the key definition to `yaml-mode-hook':}
\label{sec:org0ca6140}

\begin{verbatim}
(add-hook 'yaml-mode-hook
  '(lambda ()
    (define-key yaml-mode-map "\C-m" 'newline-and-indent))) 
\end{verbatim}

\subsection*{\LaTeX{}}
\label{sec:orgc6f286b}

\begin{verbatim}
(require 'ox-latex)
\end{verbatim}

\subsubsection*{AucTex settings}
\label{sec:org892a796}

\begin{verbatim}
(require 'tex)
\end{verbatim}

Three steps are required (as according to ORG official docs) to setup AucTex with Emacs:

\begin{itemize}
\item 1) Tell emacs where the \LaTeX{} related bins are located in the system
\label{sec:org4748a72}

\begin{verbatim}
(setq exec-path (append exec-path '("/usr/bin/tex")))
\end{verbatim}

\item 2) Load AucTex
\label{sec:org87df796}

\begin{verbatim}
;; (load "auctex.el" nil t t)
;; (load "preview-latex.el" nil t t)
\end{verbatim}

\item 3) Add Latex to list of org-babel loaded languages
\label{sec:org48748ed}

\#+END\textsubscript{SRC}
\begin{verbatim}
(org-babel-do-load-languages
 'org-babel-load-languages
 '((latex . t)))
\end{verbatim}

\begin{verbatim}
(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)
\end{verbatim}


\begin{verbatim}
(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)   
\end{verbatim}
\end{itemize}




\subsubsection*{Latex Classes}
\label{sec:org746007d}
\begin{itemize}
\item Add the beamer presentation class template to org
\label{sec:org38a417f}
\begin{verbatim}
(add-to-list 'org-latex-classes
             '("beamer"
               "\\documentclass\[presentation\]\{beamer\}"
               ("\\section\{%s\}" . "\\section*\{%s\}")
               ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
               ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
\end{verbatim}


\item Add the memoir class template to org
\label{sec:orge93dcd5}

The Sections and Heading Levels gets configured as follows: 

\begin{center}
\begin{tabular}{lrl}
Division & <c>Level & <c>org-equivalent\\
\book & -2 & *\\
\part & -1 & **\\
\chapter & 0 & \textbf{*}\\
\section & 1 & \textbf{**}\\
\subsection & 2 & \textbf{\textbf{*}}\\
\subsubsection & 3 & \textbf{\textbf{**}}\\
\paragraph & 4 & \textbf{\textbf{\textbf{*}}}\\
\subparagraph & 5 & \textbf{\textbf{\textbf{**}}}\\
\end{tabular}
\end{center}


\begin{verbatim}
(add-to-list 'org-latex-classes
             '("memoir"
               "\\documentclass\[a4paper\]\{memoir\}"
               ("\\book\{%s\}" . "\\book*\{%s\}")
               ("\\part\{%s\}" . "\\part*\{%s\}")
               ("\\chapter\{%s\}" . "\\chapter*\{%s\}")
               ("\\section\{%s\}" . "\\section*\{%s\}")
               ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
               ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
\end{verbatim}

\item Add abntex2 class to org list of latex classes
\label{sec:org16a178e}
This class is based on the Memoir class
The Sections and Heading Levels gets configured as follows: 

\begin{center}
\begin{tabular}{lrl}
Division & <c>Level & <c>org-equivalent\\
\part & -1 & *\\
\chapter & 0 & **\\
\section & 1 & \textbf{*}\\
\subsection & 2 & \textbf{**}\\
\subsubsection & 3 & \textbf{\textbf{*}}\\
\paragraph & 4 & \textbf{\textbf{**}}\\
\subparagraph & 5 & \textbf{\textbf{\textbf{*}}}\\
\end{tabular}
\end{center}
\begin{verbatim}
(add-to-list 'org-latex-classes
            '("abntex2"
              "\\documentclass\[a4paper,oneside,12pt\]\{abntex2\}"
              ("\\chapter\{%s\}" . "\\chapter*\{%s\}")
              ("\\section\{%s\}" . "\\section*\{%s\}")
              ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
              ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")
              ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")
              ("\\paragraph\{%s\}" . "\\paragraph*\{%s\}")))
\end{verbatim}
\end{itemize}


\subsubsection*{Enable latex-preview-pane}
\label{sec:org7e98401}
\begin{verbatim}
(latex-preview-pane-enable)
\end{verbatim}

\subsubsection*{To compile documents to PDF by default add the following to your \textasciitilde{}/.emacs.}
\label{sec:org7122be2}

\begin{verbatim}
(setq TeX-PDF-mode t)
\end{verbatim}

\begin{itemize}
\item If it doesn’t work, try this :
\label{sec:org3f0730c}

\begin{verbatim}
(TeX-global-PDF-mode t)
\end{verbatim}
\end{itemize}


\subsubsection*{To highlight (or font-lock) the “\section{title}” lines:}
\label{sec:orgc3d8b07}

\begin{verbatim}
(font-lock-add-keywords
   'latex-mode
   `((,(concat "^\\s-*\\\\\\("
               "\\(documentclass\\|\\(sub\\)?section[*]?\\)"
               "\\(\\[[^]% \t\n]*\\]\\)?{[-[:alnum:]_ ]+"
               "\\|"
               "\\(begin\\|end\\){document"
               "\\)}.*\n?")
      (0 'your-face append))))
\end{verbatim}


\subsubsection*{Convert quotes to \LaTeX{} Smartquotes}
\label{sec:org1a48e1a}

\begin{verbatim}
(setq org-export-with-smart-quotes t)
\end{verbatim}

\subsubsection*{Keep latex logfiles}
\label{sec:org63fad50}
\begin{verbatim}
(setq org-latex-remove-logfiles nil)
\end{verbatim}


\subsection*{Markdown}
\label{sec:orgdd06628}

\subsubsection*{Enable markdown-mode}
\label{sec:org8124812}
\begin{verbatim}
(autoload 'mardown-mode "markdown-mode")
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
\end{verbatim}


\section*{Devops tools setup and helpers (dockerfile, netlify)}
\label{sec:orgbf48e26}

\begin{verbatim}
(require 'dockerfile-mode)
(add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)) 
\end{verbatim}


\section*{Autocompletion and Snippets}
\label{sec:org334d1f8}

\subsection*{LSP (language server protocol implementation for emacs)}
\label{sec:org0f6958f}

\subsubsection*{require and create lsp-mode hook for every programming language}
\label{sec:orgdcfafd0}
\begin{verbatim}
(require 'lsp-mode)
(add-hook 'prog-mode-hook #'lsp) 
(add-hook 'enh-ruby-mode-hook #'lsp) 
(add-hook 'js2-mode-hook #'lsp) 
(add-hook 'js2-jsx-mode-hook #'lsp) 
\end{verbatim}

\subsubsection*{lsp-ui}
\label{sec:orga717767}

\begin{verbatim}
This contains all the higher level UI modules of lsp-mode, like flycheck support and code lenses.
\end{verbatim}


\begin{verbatim}
(require 'lsp-ui)
(add-hook 'lsp-mode-hook 'lsp-ui-mode)
\end{verbatim}

\subsubsection*{company-lsp}
\label{sec:org8f92314}

\begin{verbatim}
Company completion backend for lsp-mode. 
\end{verbatim}


\begin{verbatim}
(require 'company-lsp)
(push 'company-lsp company-backends)
\end{verbatim}

\subsection*{Disable <RET> for autocomplete and leave on TAB}
\label{sec:org3a50079}
\begin{verbatim}
;; (define-key ac-completing-map [return] nil)
;; (define-key ac-completing-map "\r" nil)
\end{verbatim}


\subsection*{enable autocompletion engine}
\label{sec:org770c1b3}
\begin{verbatim}
(require 'auto-complete)
(global-auto-complete-mode t)
\end{verbatim}


\subsection*{Company mode (Complete Anything)}
\label{sec:orge955e54}

\subsubsection*{Basic settings for company-mode}
\label{sec:org24857d8}
\begin{verbatim}
(require 'company)
(global-company-mode t)
(setq company-tooltip-limit 20)                      ; bigger popup window
(setq company-minimum-prefix-length 1)               ; start completing after 1st char typed
(setq company-idle-delay .1)                         ; decrease delay before autocompletion popup shows
(setq company-echo-delay 0)                          ; remove annoying blinking
(setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
(setq company-dabbrev-downcase nil)                  ; Do not convert to lowercase
(setq company-dabbrev-ignore-case t)
(setq company-dabbrev-code-everywhere t)
(setq company-selection-wrap-around t)               ; continue from top when reaching bottom
(setq company-auto-complete 'company-explicit-action-p)
\end{verbatim}
