emacs.d/emacs.org
*** Enable company-mode in all buffers
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'after-init-hook 'global-company-mode)
#+END_SRC

*** Bind <TAB> to company-indent-or-complete
#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'after-init-hook 'global-company-mode)

  (after "company-autoloads"
     (define-key evil-insert-state-map (kbd "TAB")
       #'company-indent-or-complete-common))
#+END_SRC


** Yasnippets

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'yasnippet)
  (yas-global-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
(setq yas-snippet-dirs
      '("~/.emacs.d/snippets"                 ;; personal snippets
        ))
#+END_SRC

 
* Copy/Paste To/From System's Clipboard =D
this was supposed to be on the helper functions and macro section at the beggining of the file
but it has evil defined keybindings and had to be put after the evil section or emacs would complain it didnt know what evil is
   
*** Copy
    
#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun copy-to-clipboard ()
    "Make F8 and F9 Copy and Paste to/from OS Clipboard.  Super usefull."
    (interactive)
    (if (display-graphic-p)
	(progn
	  (message "Yanked region to x-clipboard!")
	  (call-interactively 'clipboard-kill-ring-save)
	  )
      (if (region-active-p)
	  (progn
	    (shell-command-on-region (region-beginning) (region-end) "xsel -i -b")
	    (message "Yanked region to clipboard!")
	    (deactivate-mark))
	(message "No region active; can't yank to clipboard!")))
    )
#+END_SRC


*** Paste
    
#+BEGIN_SRC emacs-lisp :tangle init.el
  (evil-define-command paste-from-clipboard()
    (if (display-graphic-p)
	(progn
	  (clipboard-yank)
	  (message "graphics active")
	  )
      (insert (shell-command-to-string "xsel -o -b")) ) )
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key [f9] 'copy-to-clipboard)
  (global-set-key [f10] 'paste-from-clipboard)
#+END_SRC
  

* Provide my personal packages in separate files
  
** Provide the evil.tau.el file (this need to be the last thing on the file)
   
#+BEGIN_SRC emacs-lisp :tangle config/evil.tau.el
  (provide 'evil.tau)
  ;;; evil.tau.el ends here...
#+END_SRC

** Provide the org.tau.el file (this needs to be the last part of the org config file)
   
#+BEGIN_SRC emacs-lisp :tangle config/org.tau.el
  (provide 'org.tau)
  ;;; elixir.tau.el ends here...
#+END_SRC

** Provide the ruby.tau.el file (this needs to be the last part of the org config file)
   
#+BEGIN_SRC emacs-lisp :tangle config/ruby.tau.el
  (provide 'ruby.tau)
  ;;; elixir.tau.el ends here...
#+END_SRC

** Provide the elixir.tau.el file (this needs to be the last part of the org config file)
   
#+BEGIN_SRC emacs-lisp :tangle config/elixir.tau.el
  (provide 'elixir.tau)
  ;;; elixir.tau.el ends here...
#+END_SRC


* End init.el file
#+BEGIN_SRC emacs-lisp :tangle init.el
;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:


(provide 'init)
;;; .emacs ends here

#+END_SRC



