emacs.d/emacs.tex

\subsubsection*{Enable company-mode in all buffers}
\label{sec:orgdb27fce}
\begin{verbatim}
(add-hook 'after-init-hook 'global-company-mode)
\end{verbatim}

\subsubsection*{Bind <TAB> to company-indent-or-complete}
\label{sec:org77bdebe}
\begin{verbatim}
(add-hook 'after-init-hook 'global-company-mode)

(after "company-autoloads"
   (define-key evil-insert-state-map (kbd "TAB")
     #'company-indent-or-complete-common))
\end{verbatim}


\subsection*{Yasnippets}
\label{sec:orgd3dc01e}

\begin{verbatim}
(require 'yasnippet)
(yas-global-mode 1)
\end{verbatim}

\begin{verbatim}
(setq yas-snippet-dirs
      '("~/.emacs.d/snippets"                 ;; personal snippets
        ))
\end{verbatim}


\section*{Copy/Paste To/From System's Clipboard =D}
\label{sec:orgccfceb7}
this was supposed to be on the helper functions and macro section at the beggining of the file
but it has evil defined keybindings and had to be put after the evil section or emacs would complain it didnt know what evil is

\subsubsection*{Copy}
\label{sec:org7428cf8}

\begin{verbatim}
(defun copy-to-clipboard ()
  "Make F8 and F9 Copy and Paste to/from OS Clipboard.  Super usefull."
  (interactive)
  (if (display-graphic-p)
      (progn
        (message "Yanked region to x-clipboard!")
        (call-interactively 'clipboard-kill-ring-save)
        )
    (if (region-active-p)
        (progn
          (shell-command-on-region (region-beginning) (region-end) "xsel -i -b")
          (message "Yanked region to clipboard!")
          (deactivate-mark))
      (message "No region active; can't yank to clipboard!")))
  )
\end{verbatim}


\subsubsection*{Paste}
\label{sec:org567ad4e}

\begin{verbatim}
(evil-define-command paste-from-clipboard()
  (if (display-graphic-p)
      (progn
        (clipboard-yank)
        (message "graphics active")
        )
    (insert (shell-command-to-string "xsel -o -b")) ) )
\end{verbatim}

\begin{verbatim}
(global-set-key [f9] 'copy-to-clipboard)
(global-set-key [f10] 'paste-from-clipboard)
\end{verbatim}


\section*{Provide my personal packages in separate files}
\label{sec:orgac9fc2a}

\subsection*{Provide the evil.tau.el file (this need to be the last thing on the file)}
\label{sec:orgcd68534}

\begin{verbatim}
(provide 'evil.tau)
;;; evil.tau.el ends here...
\end{verbatim}

\subsection*{Provide the org.tau.el file (this needs to be the last part of the org config file)}
\label{sec:orgd843a7b}

\begin{verbatim}
(provide 'org.tau)
;;; elixir.tau.el ends here...
\end{verbatim}

\subsection*{Provide the ruby.tau.el file (this needs to be the last part of the org config file)}
\label{sec:org9c8aea8}

\begin{verbatim}
(provide 'ruby.tau)
;;; elixir.tau.el ends here...
\end{verbatim}

\subsection*{Provide the elixir.tau.el file (this needs to be the last part of the org config file)}
\label{sec:org7add388}

\begin{verbatim}
(provide 'elixir.tau)
;;; elixir.tau.el ends here...
\end{verbatim}


\section*{End init.el file}
\label{sec:orgff50ad9}
\begin{verbatim}
;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:


(provide 'init)
;;; .emacs ends here

\end{verbatim}
\end{document}